[Killed] BlockStatement
src/Algorithms/ShellSort.js:1:35
-export const shellSort = (arr) => {
-    var increment = arr.length / 2;
-    while (increment > 0) {
-        for (var i = increment; i < arr.length; i++) {
-            var j = i;
-            var temp = arr[i];
-
-            while (j >= increment && arr[j - increment] > temp) {
-                arr[j] = arr[j - increment];
-                j = j - increment;
-            }
-
-            arr[j] = temp;
-        }
-
-        if (increment == 2) {
-            increment = 1;
-        } else {
-            increment = parseInt(increment * 5 / 11);
-        }
-    }
-    return arr;
-}
+export const shellSort = (arr) => {}
 
killedBy: Shell Sort Tests sort array with single elements
statusReason: expected undefined to deeply equal [ 4 ]

[Survived] ArithmeticOperator
src/Algorithms/ShellSort.js:2:21
 export const shellSort = (arr) => {
-    var increment = arr.length / 2;
+    var increment = arr.length * 2;
     while (increment > 0) {
         for (var i = increment; i < arr.length; i++) {

[Killed] EqualityOperator
src/Algorithms/ShellSort.js:3:12
 export const shellSort = (arr) => {
     var increment = arr.length / 2;
-    while (increment > 0) {
+    while (increment <= 0) {
         for (var i = increment; i < arr.length; i++) {
             var j = i;
killedBy: Shell Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/ShellSort.js:4:33
 export const shellSort = (arr) => {
     var increment = arr.length / 2;
     while (increment > 0) {
-        for (var i = increment; i < arr.length; i++) {
+        for (var i = increment; i >= arr.length; i++) {
             var j = i;
             var temp = arr[i];
killedBy: Shell Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/ShellSort.js:4:33
 export const shellSort = (arr) => {
     var increment = arr.length / 2;
     while (increment > 0) {
-        for (var i = increment; i < arr.length; i++) {
+        for (var i = increment; false; i++) {
             var j = i;
             var temp = arr[i];
killedBy: Shell Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/ShellSort.js:8:42
             var j = i;
             var temp = arr[i];
 
-            while (j >= increment && arr[j - increment] > temp) {
+            while (j >= increment && arr[j + increment] > temp) {
                 arr[j] = arr[j - increment];
                 j = j - increment;
killedBy: Shell Sort Tests sort an arbitary array
statusReason: expected [ 1, 4, 3, 3, 8, …(3) ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Timeout] ConditionalExpression
src/Algorithms/ShellSort.js:16:13
             arr[j] = temp;
         }
 
-        if (increment == 2) {
+        if (true) {
             increment = 1;
         } else {
