[Killed] BlockStatement
src/Data-Structures/BST.js:4:19
 import { TreeNode } from "../models/TreeModels.js";
 
 export class BinarySearchTree {
-    constructor() {
-        this.root = null;
-    }
+    constructor() {}
 
     insert(key) {
killedBy: BST Tests .getRoot() get root of BST
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/Data-Structures/BST.js:8:17
         this.root = null;
     }
 
-    insert(key) {
-        if (this.root === null) {
-            this.root = new TreeNode(key);
-        } else {
-            this._insertNode(this.root, key);
-        }
-    }
+    insert(key) {}
 
     _insertNode(node, key) {
killedBy: BST Tests .insert(key) insert element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] ConditionalExpression
src/Data-Structures/BST.js:9:13
     }
 
     insert(key) {
-        if (this.root === null) {
+        if (true) {
             this.root = new TreeNode(key);
         } else {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected 3 to equal 10

[Killed] ConditionalExpression
src/Data-Structures/BST.js:9:13
     }
 
     insert(key) {
-        if (this.root === null) {
+        if (false) {
             this.root = new TreeNode(key);
         } else {
killedBy: BST Tests .insert(key) insert element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] BlockStatement
src/Data-Structures/BST.js:11:16
     insert(key) {
         if (this.root === null) {
             this.root = new TreeNode(key);
-        } else {
-            this._insertNode(this.root, key);
-        }
+        } else {}
     }
 
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 10 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:16:28
         }
     }
 
-    _insertNode(node, key) {
-        if (key < node.getKey()) {
-            if (node.getLeft() === null) {
-                node.setLeft(new TreeNode(key));
-            } else {
-                this._insertNode(node.getLeft(), key);
-            }
-        } else {
-            if (node.getRight() === null) {
-                node.setRight(new TreeNode(key));
-            } else {
-                this._insertNode(node.getRight(), key);
-            }
-        }
-    }
+    _insertNode(node, key) {}
 
     getRoot() {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 10 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:17:13
     }
 
     _insertNode(node, key) {
-        if (key < node.getKey()) {
+        if (true) {
             if (node.getLeft() === null) {
                 node.setLeft(new TreeNode(key));
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 3, 15, 5, 10 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:17:34
     }
 
     _insertNode(node, key) {
-        if (key < node.getKey()) {
-            if (node.getLeft() === null) {
-                node.setLeft(new TreeNode(key));
-            } else {
-                this._insertNode(node.getLeft(), key);
-            }
-        } else {
+        if (key < node.getKey()) {} else {
             if (node.getRight() === null) {
                 node.setRight(new TreeNode(key));
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:18:42
 
     _insertNode(node, key) {
         if (key < node.getKey()) {
-            if (node.getLeft() === null) {
-                node.setLeft(new TreeNode(key));
-            } else {
+            if (node.getLeft() === null) {} else {
                 this._insertNode(node.getLeft(), key);
             }
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:18:17
 
     _insertNode(node, key) {
         if (key < node.getKey()) {
-            if (node.getLeft() === null) {
+            if (true) {
                 node.setLeft(new TreeNode(key));
             } else {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 3, 10, 15 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:20:20
         if (key < node.getKey()) {
             if (node.getLeft() === null) {
                 node.setLeft(new TreeNode(key));
-            } else {
-                this._insertNode(node.getLeft(), key);
-            }
+            } else {}
         } else {
             if (node.getRight() === null) {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 5, 10, 15 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:23:16
             } else {
                 this._insertNode(node.getLeft(), key);
             }
-        } else {
-            if (node.getRight() === null) {
-                node.setRight(new TreeNode(key));
-            } else {
-                this._insertNode(node.getRight(), key);
-            }
-        }
+        } else {}
     }
 
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 3, 5, 10 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:24:17
                 this._insertNode(node.getLeft(), key);
             }
         } else {
-            if (node.getRight() === null) {
+            if (false) {
                 node.setRight(new TreeNode(key));
             } else {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] EqualityOperator
src/Data-Structures/BST.js:24:17
                 this._insertNode(node.getLeft(), key);
             }
         } else {
-            if (node.getRight() === null) {
+            if (node.getRight() !== null) {
                 node.setRight(new TreeNode(key));
             } else {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: Cannot read properties of null (reading 'getKey')

[Survived] BlockStatement
src/Data-Structures/BST.js:26:20
         } else {
             if (node.getRight() === null) {
                 node.setRight(new TreeNode(key));
-            } else {
-                this._insertNode(node.getRight(), key);
-            }
+            } else {}
         }
     }

[Killed] BlockStatement
src/Data-Structures/BST.js:32:15
         }
     }
 
-    getRoot() {
-        return this.root;
-    }
+    getRoot() {}
 
     search(key) {
killedBy: BST Tests .getRoot() get root of BST
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/Data-Structures/BST.js:36:17
         return this.root;
     }
 
-    search(key) {
-        return this._searchNode(this.root, key);
-    }
+    search(key) {}
 
     _searchNode(node, key) {
killedBy: BST Tests .search(key) search for an existing element
statusReason: expected undefined to equal true

[Killed] BlockStatement
src/Data-Structures/BST.js:40:28
         return this._searchNode(this.root, key);
     }
 
-    _searchNode(node, key) {
-        if (node === null) {
-            return false;
-        }
-
-        if (key < node.getKey()) {
-            return this._searchNode(node.getLeft(), key);
-        } else if (key > node.getKey()) {
-            return this._searchNode(node.getRight(), key);
-        }
-
-        return true;
-    }
+    _searchNode(node, key) {}
 
     inOrderTraverse(callback) {
killedBy: BST Tests .search(key) search for an existing element
statusReason: expected undefined to equal true

[Killed] BlockStatement
src/Data-Structures/BST.js:41:28
     }
 
     _searchNode(node, key) {
-        if (node === null) {
-            return false;
-        }
+        if (node === null) {}
 
         if (key < node.getKey()) {
killedBy: BST Tests .search(key) search for a non-existing element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] ConditionalExpression
src/Data-Structures/BST.js:41:13
     }
 
     _searchNode(node, key) {
-        if (node === null) {
+        if (true) {
             return false;
         }
killedBy: BST Tests .search(key) search for an existing element
statusReason: expected false to equal true

[Killed] BooleanLiteral
src/Data-Structures/BST.js:42:20
 
     _searchNode(node, key) {
         if (node === null) {
-            return false;
+            return true;
         }
 
killedBy: BST Tests .search(key) search for a non-existing element
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/Data-Structures/BST.js:45:13
             return false;
         }
 
-        if (key < node.getKey()) {
+        if (false) {
             return this._searchNode(node.getLeft(), key);
         } else if (key > node.getKey()) {
killedBy: BST Tests .search(key) search for a non-existing element
statusReason: expected true to equal false

[Killed] EqualityOperator
src/Data-Structures/BST.js:45:13
             return false;
         }
 
-        if (key < node.getKey()) {
+        if (key >= node.getKey()) {
             return this._searchNode(node.getLeft(), key);
         } else if (key > node.getKey()) {
killedBy: BST Tests .search(key) search for a non-existing element
statusReason: expected true to equal false

[Killed] ConditionalExpression
src/Data-Structures/BST.js:47:20
 
         if (key < node.getKey()) {
             return this._searchNode(node.getLeft(), key);
-        } else if (key > node.getKey()) {
+        } else if (true) {
             return this._searchNode(node.getRight(), key);
         }
killedBy: BST Tests .search(key) search for an existing element
statusReason: expected false to equal true

[Killed] BlockStatement
src/Data-Structures/BST.js:47:41
 
         if (key < node.getKey()) {
             return this._searchNode(node.getLeft(), key);
-        } else if (key > node.getKey()) {
-            return this._searchNode(node.getRight(), key);
-        }
+        } else if (key > node.getKey()) {}
 
         return true;
killedBy: BST Tests .search(key) search for a non-existing element
statusReason: expected true to equal false

[Killed] BlockStatement
src/Data-Structures/BST.js:54:31
         return true;
     }
 
-    inOrderTraverse(callback) {
-        this._inOrderTraverseNode(this.root, callback);
-    }
+    inOrderTraverse(callback) {}
 
     _inOrderTraverseNode(node, callback) {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:58:42
         this._inOrderTraverseNode(this.root, callback);
     }
 
-    _inOrderTraverseNode(node, callback) {
-        if (node !== null) {
-            this._inOrderTraverseNode(node.getLeft(), callback);
-            callback(node.getKey());
-            this._inOrderTraverseNode(node.getRight(), callback);
-        }
-    }
+    _inOrderTraverseNode(node, callback) {}
 
     preOrderTraverse(callback) {
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [] to deeply equal [ 3, 5, 10, 15 ]

[Killed] EqualityOperator
src/Data-Structures/BST.js:59:13
     }
 
     _inOrderTraverseNode(node, callback) {
-        if (node !== null) {
+        if (node === null) {
             this._inOrderTraverseNode(node.getLeft(), callback);
             callback(node.getKey());
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [] to deeply equal [ 3, 5, 10, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:59:13
     }
 
     _inOrderTraverseNode(node, callback) {
-        if (node !== null) {
+        if (true) {
             this._inOrderTraverseNode(node.getLeft(), callback);
             callback(node.getKey());
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/Data-Structures/BST.js:66:32
         }
     }
 
-    preOrderTraverse(callback) {
-        this._preOrderTraverseNode(this.root, callback);
-    }
+    preOrderTraverse(callback) {}
 
     _preOrderTraverseNode(node, callback) {
killedBy: BST Tests .preOrderTraverse(callback) insert elements and perform preorder traversal
statusReason: expected [] to deeply equal [ 10, 5, 3, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:70:43
         this._preOrderTraverseNode(this.root, callback);
     }
 
-    _preOrderTraverseNode(node, callback) {
-        if (node !== null) {
-            callback(node.getKey());
-            this._preOrderTraverseNode(node.getLeft(), callback);
-            this._preOrderTraverseNode(node.getRight(), callback);
-        }
-    }
+    _preOrderTraverseNode(node, callback) {}
 
     postOrderTraverse(callback) {
killedBy: BST Tests .preOrderTraverse(callback) insert elements and perform preorder traversal
statusReason: expected [] to deeply equal [ 10, 5, 3, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:71:13
     }
 
     _preOrderTraverseNode(node, callback) {
-        if (node !== null) {
+        if (false) {
             callback(node.getKey());
             this._preOrderTraverseNode(node.getLeft(), callback);
killedBy: BST Tests .preOrderTraverse(callback) insert elements and perform preorder traversal
statusReason: expected [] to deeply equal [ 10, 5, 3, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:71:28
     }
 
     _preOrderTraverseNode(node, callback) {
-        if (node !== null) {
-            callback(node.getKey());
-            this._preOrderTraverseNode(node.getLeft(), callback);
-            this._preOrderTraverseNode(node.getRight(), callback);
-        }
+        if (node !== null) {}
     }
 
killedBy: BST Tests .preOrderTraverse(callback) insert elements and perform preorder traversal
statusReason: expected [] to deeply equal [ 10, 5, 3, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:78:33
         }
     }
 
-    postOrderTraverse(callback) {
-        this._postOrderTraverseNode(this.root, callback);
-    }
+    postOrderTraverse(callback) {}
 
     _postOrderTraverseNode(node, callback) {
killedBy: BST Tests .postOrderTraverse(callback) insert elements and perform postrder traversal
statusReason: expected [] to deeply equal [ 3, 5, 15, 10 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:82:44
         this._postOrderTraverseNode(this.root, callback);
     }
 
-    _postOrderTraverseNode(node, callback) {
-        if (node !== null) {
-            this._postOrderTraverseNode(node.getLeft(), callback);
-            this._postOrderTraverseNode(node.getRight(), callback);
-            callback(node.getKey());
-        }
-    }
+    _postOrderTraverseNode(node, callback) {}
 
     findMin() {
killedBy: BST Tests .postOrderTraverse(callback) insert elements and perform postrder traversal
statusReason: expected [] to deeply equal [ 3, 5, 15, 10 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:83:13
     }
 
     _postOrderTraverseNode(node, callback) {
-        if (node !== null) {
+        if (false) {
             this._postOrderTraverseNode(node.getLeft(), callback);
             this._postOrderTraverseNode(node.getRight(), callback);
killedBy: BST Tests .postOrderTraverse(callback) insert elements and perform postrder traversal
statusReason: expected [] to deeply equal [ 3, 5, 15, 10 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:83:13
     }
 
     _postOrderTraverseNode(node, callback) {
-        if (node !== null) {
+        if (true) {
             this._postOrderTraverseNode(node.getLeft(), callback);
             this._postOrderTraverseNode(node.getRight(), callback);
killedBy: BST Tests .postOrderTraverse(callback) insert elements and perform postrder traversal
statusReason: Cannot read properties of null (reading 'getLeft')

[Killed] BlockStatement
src/Data-Structures/BST.js:90:15
         }
     }
 
-    findMin() {
-        return this._findMinNode(this.root).getKey();
-    }
+    findMin() {}
 
     _findMinNode(node) {
killedBy: BST Tests .findMin() find the minimum element
statusReason: expected undefined to equal 3

[Killed] BlockStatement
src/Data-Structures/BST.js:94:24
         return this._findMinNode(this.root).getKey();
     }
 
-    _findMinNode(node) {
-        let current = node;
-        while (current !== null && current.getLeft() !== null) {
-            current = current.getLeft();
-        }
-        return current;
-    }
+    _findMinNode(node) {}
 
     findMax() {
killedBy: BST Tests .findMin() find the minimum element
statusReason: Cannot read properties of undefined (reading 'getKey')

[Killed] ConditionalExpression
src/Data-Structures/BST.js:96:16
 
     _findMinNode(node) {
         let current = node;
-        while (current !== null && current.getLeft() !== null) {
+        while (false) {
             current = current.getLeft();
         }
killedBy: BST Tests .findMin() find the minimum element
statusReason: expected 10 to equal 3

[Killed] ConditionalExpression
src/Data-Structures/BST.js:96:36
 
     _findMinNode(node) {
         let current = node;
-        while (current !== null && current.getLeft() !== null) {
+        while (current !== null && true) {
             current = current.getLeft();
         }
killedBy: BST Tests .findMin() find the minimum element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] BlockStatement
src/Data-Structures/BST.js:102:15
         return current;
     }
 
-    findMax() {
-        return this._findMaxNode(this.root).getKey();
-    }
+    findMax() {}
 
     _findMaxNode(node) {
killedBy: BST Tests .findMax() find the maximum element
statusReason: expected undefined to equal 15

[Killed] BlockStatement
src/Data-Structures/BST.js:106:24
         return this._findMaxNode(this.root).getKey();
     }
 
-    _findMaxNode(node) {
-        let current = node;
-        while (current !== null && current.getRight() !== null) {
-            current = current.getRight();
-        }
-        return current;
-    }
+    _findMaxNode(node) {}
     
     findCeil(key) {
killedBy: BST Tests .findMax() find the maximum element
statusReason: Cannot read properties of undefined (reading 'getKey')

[Killed] ConditionalExpression
src/Data-Structures/BST.js:108:36
 
     _findMaxNode(node) {
         let current = node;
-        while (current !== null && current.getRight() !== null) {
+        while (current !== null && true) {
             current = current.getRight();
         }
killedBy: BST Tests .findMax() find the maximum element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] LogicalOperator
src/Data-Structures/BST.js:108:16
 
     _findMaxNode(node) {
         let current = node;
-        while (current !== null && current.getRight() !== null) {
+        while (current !== null || current.getRight() !== null) {
             current = current.getRight();
         }
killedBy: BST Tests .findMax() find the maximum element
statusReason: Cannot read properties of null (reading 'getRight')

[Killed] BlockStatement
src/Data-Structures/BST.js:114:19
         return current;
     }
     
-    findCeil(key) {
-        return this._findCeilNode(this.root, key);
-    }
+    findCeil(key) {}
 
     _findCeilNode(node, key, ceil = null) {
killedBy: BST Tests .findCeil() find the ceil element
statusReason: expected undefined to equal 10

[Killed] BlockStatement
src/Data-Structures/BST.js:118:43
         return this._findCeilNode(this.root, key);
     }
 
-    _findCeilNode(node, key, ceil = null) {
-        if (node === null) {
-            return ceil;
-        }
-
-        if (node.getKey() === key) {
-            return node.getKey();
-        } else if (node.getKey() < key) {
-            return this._findCeilNode(node.getRight(), key, ceil);
-        } else {
-            ceil = node.getKey();
-            return this._findCeilNode(node.getLeft(), key, ceil);
-        }
-    }
+    _findCeilNode(node, key, ceil = null) {}
 
     findFloor(key) {
killedBy: BST Tests .findCeil() find the ceil element
statusReason: expected undefined to equal 10

[Killed] ConditionalExpression
src/Data-Structures/BST.js:119:13
     }
 
     _findCeilNode(node, key, ceil = null) {
-        if (node === null) {
+        if (false) {
             return ceil;
         }
killedBy: BST Tests .findCeil() find the ceil element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] BlockStatement
src/Data-Structures/BST.js:119:28
     }
 
     _findCeilNode(node, key, ceil = null) {
-        if (node === null) {
-            return ceil;
-        }
+        if (node === null) {}
 
         if (node.getKey() === key) {
killedBy: BST Tests .findCeil() find the ceil element
statusReason: Cannot read properties of null (reading 'getKey')

[Survived] ConditionalExpression
src/Data-Structures/BST.js:123:13
             return ceil;
         }
 
-        if (node.getKey() === key) {
+        if (false) {
             return node.getKey();
         } else if (node.getKey() < key) {

[Survived] ConditionalExpression
src/Data-Structures/BST.js:123:13
             return ceil;
         }
 
-        if (node.getKey() === key) {
+        if (true) {
             return node.getKey();
         } else if (node.getKey() < key) {

[Killed] ConditionalExpression
src/Data-Structures/BST.js:125:20
 
         if (node.getKey() === key) {
             return node.getKey();
-        } else if (node.getKey() < key) {
+        } else if (true) {
             return this._findCeilNode(node.getRight(), key, ceil);
         } else {
killedBy: BST Tests .findCeil() find the ceil element
statusReason: expected null to equal 10

[Killed] ConditionalExpression
src/Data-Structures/BST.js:125:20
 
         if (node.getKey() === key) {
             return node.getKey();
-        } else if (node.getKey() < key) {
+        } else if (false) {
             return this._findCeilNode(node.getRight(), key, ceil);
         } else {
killedBy: BST Tests .findCeil() find the ceil element
statusReason: expected 3 to equal 10

[Killed] BlockStatement
src/Data-Structures/BST.js:127:16
             return node.getKey();
         } else if (node.getKey() < key) {
             return this._findCeilNode(node.getRight(), key, ceil);
-        } else {
-            ceil = node.getKey();
-            return this._findCeilNode(node.getLeft(), key, ceil);
-        }
+        } else {}
     }
 
killedBy: BST Tests .findCeil() find the ceil element
statusReason: expected undefined to equal 10

[Killed] BlockStatement
src/Data-Structures/BST.js:133:20
         }
     }
 
-    findFloor(key) {
-        return this._findFloorNode(this.root, key);
-    }
+    findFloor(key) {}
 
     _findFloorNode(node, key, floor = null) {
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected undefined to equal 5

[Killed] BlockStatement
src/Data-Structures/BST.js:137:45
         return this._findFloorNode(this.root, key);
     }
 
-    _findFloorNode(node, key, floor = null) {
-        if (node === null) {
-            return floor;
-        }
-
-        if (node.getKey() === key) {
-            return node.getKey();
-        } else if (node.getKey() > key) {
-            return this._findFloorNode(node.getLeft(), key, floor);
-        } else {
-            floor = node.getKey();
-            return this._findFloorNode(node.getRight(), key, floor);
-        }
-    }
+    _findFloorNode(node, key, floor = null) {}
 
     remove(key) {
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected undefined to equal 5

[Killed] BlockStatement
src/Data-Structures/BST.js:138:28
     }
 
     _findFloorNode(node, key, floor = null) {
-        if (node === null) {
-            return floor;
-        }
+        if (node === null) {}
 
         if (node.getKey() === key) {
killedBy: BST Tests .findFloor() find the floor element
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] ConditionalExpression
src/Data-Structures/BST.js:138:13
     }
 
     _findFloorNode(node, key, floor = null) {
-        if (node === null) {
+        if (true) {
             return floor;
         }
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected null to equal 5

[Killed] EqualityOperator
src/Data-Structures/BST.js:142:13
             return floor;
         }
 
-        if (node.getKey() === key) {
+        if (node.getKey() !== key) {
             return node.getKey();
         } else if (node.getKey() > key) {
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected 10 to equal 5

[Killed] ConditionalExpression
src/Data-Structures/BST.js:144:20
 
         if (node.getKey() === key) {
             return node.getKey();
-        } else if (node.getKey() > key) {
+        } else if (false) {
             return this._findFloorNode(node.getLeft(), key, floor);
         } else {
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected 15 to equal 5

[Killed] ConditionalExpression
src/Data-Structures/BST.js:144:20
 
         if (node.getKey() === key) {
             return node.getKey();
-        } else if (node.getKey() > key) {
+        } else if (true) {
             return this._findFloorNode(node.getLeft(), key, floor);
         } else {
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected null to equal 5

[Killed] BlockStatement
src/Data-Structures/BST.js:146:16
             return node.getKey();
         } else if (node.getKey() > key) {
             return this._findFloorNode(node.getLeft(), key, floor);
-        } else {
-            floor = node.getKey();
-            return this._findFloorNode(node.getRight(), key, floor);
-        }
+        } else {}
     }
 
killedBy: BST Tests .findFloor() find the floor element
statusReason: expected undefined to equal 5

[Killed] BlockStatement
src/Data-Structures/BST.js:152:17
         }
     }
 
-    remove(key) {
-        this.root = this._removeNode(this.root, key);
-    }
+    remove(key) {}
 
     _removeNode(node, key) {
killedBy: BST Tests .remove(key) remove a leaf node
statusReason: expected [ 3, 5, 10, 15 ] to deeply equal [ 5, 10, 15 ]

[Killed] EqualityOperator
src/Data-Structures/BST.js:157:13
     }
 
     _removeNode(node, key) {
-        if (node === null) {
+        if (node !== null) {
             return null;
         }
killedBy: BST Tests .remove(key) remove a leaf node
statusReason: expected [] to deeply equal [ 5, 10, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:157:13
     }
 
     _removeNode(node, key) {
-        if (node === null) {
+        if (true) {
             return null;
         }
killedBy: BST Tests .remove(key) remove a leaf node
statusReason: expected [] to deeply equal [ 5, 10, 15 ]

[Killed] EqualityOperator
src/Data-Structures/BST.js:161:13
             return null;
         }
 
-        if (key < node.getKey()) {
+        if (key <= node.getKey()) {
             node.setLeft(this._removeNode(node.getLeft(), key));
             return node;
killedBy: BST Tests .remove(key) remove a leaf node
statusReason: expected [ 3, 5, 10, 15 ] to deeply equal [ 5, 10, 15 ]

[Killed] EqualityOperator
src/Data-Structures/BST.js:164:20
         if (key < node.getKey()) {
             node.setLeft(this._removeNode(node.getLeft(), key));
             return node;
-        } else if (key > node.getKey()) {
+        } else if (key >= node.getKey()) {
             node.setRight(this._removeNode(node.getRight(), key));
             return node;
killedBy: BST Tests .remove(key) remove a leaf node
statusReason: expected [ 3, 5, 10, 15 ] to deeply equal [ 5, 10, 15 ]

[Killed] ConditionalExpression
src/Data-Structures/BST.js:164:20
         if (key < node.getKey()) {
             node.setLeft(this._removeNode(node.getLeft(), key));
             return node;
-        } else if (key > node.getKey()) {
+        } else if (true) {
             node.setRight(this._removeNode(node.getRight(), key));
             return node;
killedBy: BST Tests .remove(key) remove a leaf node
statusReason: expected [ 3, 5, 10, 15 ] to deeply equal [ 5, 10, 15 ]

[Killed] EqualityOperator
src/Data-Structures/BST.js:171:13
 
         // Key is equal to node.key, handle three cases
         // Case 1: Leaf node
-        if (node.getLeft() === null && node.getRight() === null) {
+        if (node.getLeft() !== null && node.getRight() === null) {
             node = null;
             return node;
killedBy: BST Tests .remove(key) remove a node with one child
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 10, 15 ]

[Killed] LogicalOperator
src/Data-Structures/BST.js:171:13
 
         // Key is equal to node.key, handle three cases
         // Case 1: Leaf node
-        if (node.getLeft() === null && node.getRight() === null) {
+        if (node.getLeft() === null || node.getRight() === null) {
             node = null;
             return node;
killedBy: BST Tests .remove(key) remove a node with one child
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 10, 15 ]
