[Killed] ConditionalExpression
src/Data-Structures/BST.js:177:13
         }
 
         // Case 2: Node with only one child
-        if (node.getLeft() === null) {
+        if (true) {
             node = node.getRight();
             return node;
killedBy: BST Tests .remove(key) remove a node with one child
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 10, 15 ]

[Killed] EqualityOperator
src/Data-Structures/BST.js:177:13
         }
 
         // Case 2: Node with only one child
-        if (node.getLeft() === null) {
+        if (node.getLeft() !== null) {
             node = node.getRight();
             return node;
killedBy: BST Tests .remove(key) remove a node with one child
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 10, 15 ]

[Killed] BlockStatement
src/Data-Structures/BST.js:180:46
         if (node.getLeft() === null) {
             node = node.getRight();
             return node;
-        } else if (node.getRight() === null) {
-            node = node.getLeft();
-            return node;
-        }
+        } else if (node.getRight() === null) {}
 
         // Case 3: Node with two children
killedBy: BST Tests .remove(key) remove a node with one child
statusReason: Cannot read properties of null (reading 'getKey')

[Killed] EqualityOperator
src/Data-Structures/BST.js:180:20
         if (node.getLeft() === null) {
             node = node.getRight();
             return node;
-        } else if (node.getRight() === null) {
+        } else if (node.getRight() !== null) {
             node = node.getLeft();
             return node;
killedBy: BST Tests .remove(key) remove a node with one child
statusReason: Cannot read properties of null (reading 'getKey')
