[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:5:19
 import { DoublyNode } from '../models/LinkedListModels.js';
 
 export default class DoublyLinkedList extends LinkedList {
-    constructor() {
-        super();
-        this.tail = null;
-    }
+    constructor() {}
 
     push(element) {
killedBy: Doubly Linked List Tests .getHead() get the head of linked list
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:10:19
         this.tail = null;
     }
 
-    push(element) {
-        const node = new DoublyNode(element);
-        if (this.head == null) {
-            this.head = node;
-            this.tail = node; // NEW
-        } else {
-            this.tail.setNext(node);
-            node.setPrev(this.tail);
-            this.tail = node;
-        }
-        this.count++;
-    }
+    push(element) {}
 
     insertAt(element, index) {
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:12:13
 
     push(element) {
         const node = new DoublyNode(element);
-        if (this.head == null) {
+        if (this.head != null) {
             this.head = node;
             this.tail = node; // NEW
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:12:32
 
     push(element) {
         const node = new DoublyNode(element);
-        if (this.head == null) {
-            this.head = node;
-            this.tail = node; // NEW
-        } else {
+        if (this.head == null) {} else {
             this.tail.setNext(node);
             node.setPrev(this.tail);
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:15:16
         if (this.head == null) {
             this.head = node;
             this.tail = node; // NEW
-        } else {
-            this.tail.setNext(node);
-            node.setPrev(this.tail);
-            this.tail = node;
-        }
+        } else {}
         this.count++;
     }
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] UpdateOperator
src/Data-Structures/DoublyLinkedList.js:20:9
             node.setPrev(this.tail);
             this.tail = node;
         }
-        this.count++;
+        this.count--;
     }
 
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: expected -2 to equal 2

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:24:26
     }
 
     insertAt(element, index) {
-        if (index < 0 || index > this.count) {
+        if (index < 0 || false) {
             throw new Error('.insertAt: Index out of bounds error');
         }
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at invalid index
statusReason: expected Error: .getElementAt: Index out of bounds… to have property 'message' of '.insertAt: Index out of bounds error', but got '.getElementAt: Index out of bounds er…'

[Killed] LogicalOperator
src/Data-Structures/DoublyLinkedList.js:24:13
     }
 
     insertAt(element, index) {
-        if (index < 0 || index > this.count) {
+        if (index < 0 && index > this.count) {
             throw new Error('.insertAt: Index out of bounds error');
         }
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at invalid index
statusReason: expected Error: .getElementAt: Index out of bounds… to have property 'message' of '.insertAt: Index out of bounds error', but got '.getElementAt: Index out of bounds er…'

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:29:13
         }
         const node = new DoublyNode(element);
         let current = this.head;
-        if (index === 0) {
+        if (false) {
             if (this.head == null) { // NEW
                 this.head = node;
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at index 0 in empty list
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:29:13
         }
         const node = new DoublyNode(element);
         let current = this.head;
-        if (index === 0) {
+        if (true) {
             if (this.head == null) { // NEW
                 this.head = node;
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at last index
statusReason: expected 4 to equal 5

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:30:17
         const node = new DoublyNode(element);
         let current = this.head;
         if (index === 0) {
-            if (this.head == null) { // NEW
+            if (this.head != null) { // NEW
                 this.head = node;
                 this.tail = node; // NEW
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at index 0 in empty list
statusReason: Cannot read properties of null (reading 'setPrev')

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:30:17
         const node = new DoublyNode(element);
         let current = this.head;
         if (index === 0) {
-            if (this.head == null) { // NEW
+            if (false) { // NEW
                 this.head = node;
                 this.tail = node; // NEW
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at index 0 in empty list
statusReason: Cannot read properties of null (reading 'setPrev')

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:33:20
             if (this.head == null) { // NEW
                 this.head = node;
                 this.tail = node; // NEW
-            } else {
-                node.setNext(this.head);
-                this.head.setPrev(node); // NEW
-                this.head = node;
-            } 
+            } else {} 
         } else if (index === this.count) { // last item NEW
             current = this.tail;
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at index 0
statusReason: expected 1 to equal +0

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:38:20
                 this.head.setPrev(node); // NEW
                 this.head = node;
             } 
-        } else if (index === this.count) { // last item NEW
+        } else if (index !== this.count) { // last item NEW
             current = this.tail;
             current.setNext(node);
killedBy: Doubly Linked List Tests .insertAt(element, index) insert at last index
statusReason: Cannot read properties of null (reading 'setPrev')

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:38:20
                 this.head.setPrev(node); // NEW
                 this.head = node;
             } 
-        } else if (index === this.count) { // last item NEW
+        } else if (true) { // last item NEW
             current = this.tail;
             current.setNext(node);
killedBy: Doubly Linked List Tests .insertAt(element, index) insert in between
statusReason: expected 3 to equal 9

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:43:16
             current.setNext(node);
             node.setPrev(current);
             this.tail = node;
-        } else {
-            const previous = this.getElementAt(index - 1);
-            current = previous.getNext();
-            node.setNext(current);
-            previous.setNext(node);
-            current.setPrev(node); // NEW
-            node.setPrev(previous); // NEW
-        }
+        } else {}
         this.count++;
     }
killedBy: Doubly Linked List Tests .insertAt(element, index) insert in between
statusReason: expected 3 to equal 9

[Killed] ArithmeticOperator
src/Data-Structures/DoublyLinkedList.js:44:48
             node.setPrev(current);
             this.tail = node;
         } else {
-            const previous = this.getElementAt(index - 1);
+            const previous = this.getElementAt(index + 1);
             current = previous.getNext();
             node.setNext(current);
killedBy: Doubly Linked List Tests .insertAt(element, index) insert in between
statusReason: Cannot read properties of null (reading 'setPrev')

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:55:13
     }
 
     removeAt(index) {
-        if (index < 0 || index >= this.count) {
+        if (true) {
             throw new Error('.removeAt: Index out of bounds error');
         }
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: .removeAt: Index out of bounds error

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:55:13
     }
 
     removeAt(index) {
-        if (index < 0 || index >= this.count) {
+        if (false) {
             throw new Error('.removeAt: Index out of bounds error');
         }
killedBy: Doubly Linked List Tests .removeAt(index) remove with invalid index(pos)
statusReason: expected Error: .getElementAt: Index out of bounds… to have property 'message' of '.removeAt: Index out of bounds error', but got '.getElementAt: Index out of bounds er…'

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:60:13
         }
 
         let current = this.head;
-        if (index === 0) {
+        if (index !== 0) {
             this.head = this.head.getNext();
             if (this.count === 1) {
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: Cannot read properties of null (reading 'setNext')

[Survived] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:62:17
         let current = this.head;
         if (index === 0) {
             this.head = this.head.getNext();
-            if (this.count === 1) {
+            if (this.count !== 1) {
                 this.tail = null;
             } else {

[Survived] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:62:17
         let current = this.head;
         if (index === 0) {
             this.head = this.head.getNext();
-            if (this.count === 1) {
+            if (true) {
                 this.tail = null;
             } else {

[Survived] BlockStatement
src/Data-Structures/DoublyLinkedList.js:64:20
             this.head = this.head.getNext();
             if (this.count === 1) {
                 this.tail = null;
-            } else {
-                this.head.setPrev(null);
-            }
+            } else {}
         } else if (index === this.count - 1) {
             current = this.tail;

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:67:20
             } else {
                 this.head.setPrev(null);
             }
-        } else if (index === this.count - 1) {
+        } else if (index !== this.count - 1) {
             current = this.tail;
             this.tail = current.getPrev();
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: expected 4 to equal 3

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:67:20
             } else {
                 this.head.setPrev(null);
             }
-        } else if (index === this.count - 1) {
+        } else if (true) {
             current = this.tail;
             this.tail = current.getPrev();
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: expected 4 to equal 3

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:71:16
             current = this.tail;
             this.tail = current.getPrev();
             this.tail.setNext(null);
-        } else {
-            current = this.getElementAt(index);
-            const previous = current.getPrev();
-            previous.setNext(current.getNext());
-            current.getNext().setPrev(previous); // NEW
-        }
+        } else {}
         this.count--;
         return current.getElement();
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: expected 2 to equal 3

[Killed] UpdateOperator
src/Data-Structures/DoublyLinkedList.js:77:9
             previous.setNext(current.getNext());
             current.getNext().setPrev(previous); // NEW
         }
-        this.count--;
+        this.count++;
         return current.getElement();
 
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: expected 6 to equal 2

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:82:22
 
     }
 
-    indexOf(element) {
-        let current = this.head;
-        let index = 0;
-        while (current != null) {
-            if (element === current.getElement()) {
-                return index;
-            }
-            index++;
-            current = current.getNext();
-        }
-        return -1;
-    }
+    indexOf(element) {}
 
     getHead() {
killedBy: Doubly Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected undefined to equal 1

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:85:16
     indexOf(element) {
         let current = this.head;
         let index = 0;
-        while (current != null) {
+        while (current == null) {
             if (element === current.getElement()) {
                 return index;
killedBy: Doubly Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected -1 to equal 1

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:85:16
     indexOf(element) {
         let current = this.head;
         let index = 0;
-        while (current != null) {
+        while (false) {
             if (element === current.getElement()) {
                 return index;
killedBy: Doubly Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected -1 to equal 1

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:86:17
         let current = this.head;
         let index = 0;
         while (current != null) {
-            if (element === current.getElement()) {
+            if (true) {
                 return index;
             }
killedBy: Doubly Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:86:17
         let current = this.head;
         let index = 0;
         while (current != null) {
-            if (element === current.getElement()) {
+            if (false) {
                 return index;
             }
killedBy: Doubly Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected -1 to equal 1

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:95:15
         return -1;
     }
 
-    getHead() {
-        return this.head;
-    }
+    getHead() {}
 
     getTail() {
killedBy: Doubly Linked List Tests .getHead() get the head of linked list
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:99:15
         return this.head;
     }
 
-    getTail() {
-        return this.tail;
-    }
+    getTail() {}
 
     isEmpty() {
killedBy: Doubly Linked List Tests .getTail() get the head of linked list
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:107:12
         return this.size() === 0;
     }
 
-    size() {
-        return this.count;
-    }
+    size() {}
 
     clear() {
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: expected undefined to equal 2

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:111:13
         return this.count;
     }
 
-    clear() {
-        super.clear();
-        this.tail = null;
-    }
+    clear() {}
 
     toString() {
killedBy: Doubly Linked List Tests .clear() clear the linked list
statusReason: expected DoublyNode{ element: 1, …(2) } to equal null

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:116:16
         this.tail = null;
     }
 
-    toString() {
-        if (this.head == null) {
-            return '';
-        }
-        let objString = `${this.head.getElement()}`;
-        let current = this.head.getNext();
-        while (current != null) {
-            objString = `${objString},${current.getElement()}`;
-            current = current.getNext();
-        }
-        return objString;
-    }
+    toString() {}
 
     inverseToString() {
killedBy: Doubly Linked List Tests .toString() get string of elements if non-empty
statusReason: expected undefined to equal '1,2,3'

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:117:13
     }
 
     toString() {
-        if (this.head == null) {
+        if (this.head != null) {
             return '';
         }
killedBy: Doubly Linked List Tests .toString() get string of elements if non-empty
statusReason: expected '' to equal '1,2,3'

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:117:13
     }
 
     toString() {
-        if (this.head == null) {
+        if (true) {
             return '';
         }
killedBy: Doubly Linked List Tests .toString() get string of elements if non-empty
statusReason: expected '' to equal '1,2,3'

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:122:16
         }
         let objString = `${this.head.getElement()}`;
         let current = this.head.getNext();
-        while (current != null) {
+        while (current == null) {
             objString = `${objString},${current.getElement()}`;
             current = current.getNext();
killedBy: Doubly Linked List Tests .toString() get string of elements if non-empty
statusReason: expected '1' to equal '1,2,3'

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:122:16
         }
         let objString = `${this.head.getElement()}`;
         let current = this.head.getNext();
-        while (current != null) {
+        while (false) {
             objString = `${objString},${current.getElement()}`;
             current = current.getNext();
killedBy: Doubly Linked List Tests .toString() get string of elements if non-empty
statusReason: expected '1' to equal '1,2,3'

[Killed] BlockStatement
src/Data-Structures/DoublyLinkedList.js:129:23
         return objString;
     }
 
-    inverseToString() {
-        if (this.tail == null) {
-            return '';
-        }
-        let objString = `${this.tail.getElement()}`;
-        let previous = this.tail.getPrev();
-        while (previous != null) {
-            objString = `${objString},${previous.getElement()}`;
-            previous = previous.getPrev();
-        }
-        return objString;
-    }
+    inverseToString() {}
 }
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected undefined to equal '3,2,1'

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:130:13
     }
 
     inverseToString() {
-        if (this.tail == null) {
+        if (this.tail != null) {
             return '';
         }
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '' to equal '3,2,1'

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:130:13
     }
 
     inverseToString() {
-        if (this.tail == null) {
+        if (true) {
             return '';
         }
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '' to equal '3,2,1'

[Killed] EqualityOperator
src/Data-Structures/DoublyLinkedList.js:135:16
         }
         let objString = `${this.tail.getElement()}`;
         let previous = this.tail.getPrev();
-        while (previous != null) {
+        while (previous == null) {
             objString = `${objString},${previous.getElement()}`;
             previous = previous.getPrev();
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '3' to equal '3,2,1'

[Killed] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:135:16
         }
         let objString = `${this.tail.getElement()}`;
         let previous = this.tail.getPrev();
-        while (previous != null) {
+        while (false) {
             objString = `${objString},${previous.getElement()}`;
             previous = previous.getPrev();
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '3' to equal '3,2,1'

[Killed] StringLiteral
src/Data-Structures/DoublyLinkedList.js:136:25
         let objString = `${this.tail.getElement()}`;
         let previous = this.tail.getPrev();
         while (previous != null) {
-            objString = `${objString},${previous.getElement()}`;
+            objString = ``;
             previous = previous.getPrev();
         }
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '' to equal '3,2,1'
