[Killed] BlockStatement
src/Algorithms/BubbleSort.js:1:36
-export const bubbleSort = (arr) => {
-    let length = arr.length;
-    let swapped = false;
-    do {
-        swapped = false;
-        for (let i = 0; i < length; i++) {
-            if (arr[i] > arr[i + 1]) {
-                let temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                swapped = true;
-            }
-        }
-    } while (swapped);
-    return arr;
-};
+export const bubbleSort = (arr) => {};
 
 
killedBy: Bubble Sort Tests sort array with single elements
statusReason: expected undefined to deeply equal [ 4 ]

[Survived] BooleanLiteral
src/Algorithms/BubbleSort.js:3:19
 export const bubbleSort = (arr) => {
     let length = arr.length;
-    let swapped = false;
+    let swapped = true;
     do {
         swapped = false;

[Killed] BlockStatement
src/Algorithms/BubbleSort.js:4:8
 export const bubbleSort = (arr) => {
     let length = arr.length;
     let swapped = false;
-    do {
-        swapped = false;
-        for (let i = 0; i < length; i++) {
-            if (arr[i] > arr[i + 1]) {
-                let temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                swapped = true;
-            }
-        }
-    } while (swapped);
+    do {} while (swapped);
     return arr;
 };
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Timeout] BooleanLiteral
src/Algorithms/BubbleSort.js:5:19
     let length = arr.length;
     let swapped = false;
     do {
-        swapped = false;
+        swapped = true;
         for (let i = 0; i < length; i++) {
             if (arr[i] > arr[i + 1]) {

[Killed] BlockStatement
src/Algorithms/BubbleSort.js:6:42
     let swapped = false;
     do {
         swapped = false;
-        for (let i = 0; i < length; i++) {
-            if (arr[i] > arr[i + 1]) {
-                let temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                swapped = true;
-            }
-        }
+        for (let i = 0; i < length; i++) {}
     } while (swapped);
     return arr;
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/BubbleSort.js:6:25
     let swapped = false;
     do {
         swapped = false;
-        for (let i = 0; i < length; i++) {
+        for (let i = 0; i >= length; i++) {
             if (arr[i] > arr[i + 1]) {
                 let temp = arr[i];
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/BubbleSort.js:7:38
     do {
         swapped = false;
         for (let i = 0; i < length; i++) {
-            if (arr[i] > arr[i + 1]) {
-                let temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                swapped = true;
-            }
+            if (arr[i] > arr[i + 1]) {}
         }
     } while (swapped);
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/BubbleSort.js:7:30
     do {
         swapped = false;
         for (let i = 0; i < length; i++) {
-            if (arr[i] > arr[i + 1]) {
+            if (arr[i] > arr[i - 1]) {
                 let temp = arr[i];
                 arr[i] = arr[i + 1];
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, undefined, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/BubbleSort.js:9:30
         for (let i = 0; i < length; i++) {
             if (arr[i] > arr[i + 1]) {
                 let temp = arr[i];
-                arr[i] = arr[i + 1];
+                arr[i] = arr[i - 1];
                 arr[i + 1] = temp;
                 swapped = true;
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BooleanLiteral
src/Algorithms/BubbleSort.js:11:27
                 let temp = arr[i];
                 arr[i] = arr[i + 1];
                 arr[i + 1] = temp;
-                swapped = true;
+                swapped = false;
             }
         }
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 3, 1, 3, 4, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/BubbleSort.js:14:14
                 swapped = true;
             }
         }
-    } while (swapped);
+    } while (false);
     return arr;
 };
killedBy: Bubble Sort Tests sort an arbitary array
statusReason: expected [ 3, 1, 3, 4, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]
