[Killed] BlockStatement
src/Algorithms/BucketSort.js:2:36
 import { insertionSort } from "./InsertionSort.js";
-export const bucketSort = (arr) => {
-    const n = arr.length;
-    if (n === 0) {
-        return arr;
-    }
-
-    const minValue = Math.min(...arr);
-    const maxValue = Math.max(...arr);
-    const bucketSize = 5;
-    const bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
-    const allBuckets = new Array(bucketCount).fill().map(() => []);
-
-    arr.forEach((currentVal) => {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
-    });
-
-    arr.length = 0;
-    allBuckets.forEach((bucket) => {
-        insertionSort(bucket);
-        arr.push(...bucket);
-    });
-
-    return arr;
-};
+export const bucketSort = (arr) => {};
killedBy: Bucket Sort Tests sort array with no elements
statusReason: expected undefined to deeply equal []

[Killed] EqualityOperator
src/Algorithms/BucketSort.js:4:9
 import { insertionSort } from "./InsertionSort.js";
 export const bucketSort = (arr) => {
     const n = arr.length;
-    if (n === 0) {
+    if (n !== 0) {
         return arr;
     }
killedBy: Bucket Sort Tests sort array with no elements
statusReason: Invalid array length

[Killed] ConditionalExpression
src/Algorithms/BucketSort.js:4:9
 import { insertionSort } from "./InsertionSort.js";
 export const bucketSort = (arr) => {
     const n = arr.length;
-    if (n === 0) {
+    if (true) {
         return arr;
     }
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] MethodExpression
src/Algorithms/BucketSort.js:8:22
         return arr;
     }
 
-    const minValue = Math.min(...arr);
+    const minValue = Math.max(...arr);
     const maxValue = Math.max(...arr);
     const bucketSize = 5;
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] MethodExpression
src/Algorithms/BucketSort.js:9:22
     }
 
     const minValue = Math.min(...arr);
-    const maxValue = Math.max(...arr);
+    const maxValue = Math.min(...arr);
     const bucketSize = 5;
     const bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
src/Algorithms/BucketSort.js:11:25
     const minValue = Math.min(...arr);
     const maxValue = Math.max(...arr);
     const bucketSize = 5;
-    const bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
+    const bucketCount = Math.floor((maxValue - minValue) / bucketSize) - 1;
     const allBuckets = new Array(bucketCount).fill().map(() => []);
 
killedBy: Bucket Sort Tests sort array with single elements
statusReason: Invalid array length

[Survived] ArithmeticOperator
src/Algorithms/BucketSort.js:11:37
     const minValue = Math.min(...arr);
     const maxValue = Math.max(...arr);
     const bucketSize = 5;
-    const bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
+    const bucketCount = Math.floor((maxValue + minValue) / bucketSize) + 1;
     const allBuckets = new Array(bucketCount).fill().map(() => []);
 

[Killed] ArrowFunction
src/Algorithms/BucketSort.js:12:58
     const maxValue = Math.max(...arr);
     const bucketSize = 5;
     const bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
-    const allBuckets = new Array(bucketCount).fill().map(() => []);
+    const allBuckets = new Array(bucketCount).fill().map(() => undefined);
 
     arr.forEach((currentVal) => {
killedBy: Bucket Sort Tests sort array with single elements
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/Algorithms/BucketSort.js:14:33
     const bucketCount = Math.floor((maxValue - minValue) / bucketSize) + 1;
     const allBuckets = new Array(bucketCount).fill().map(() => []);
 
-    arr.forEach((currentVal) => {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
-    });
+    arr.forEach((currentVal) => {});
 
     arr.length = 0;
killedBy: Bucket Sort Tests sort array with single elements
statusReason: expected [] to deeply equal [ 4 ]

[Killed] ArithmeticOperator
src/Algorithms/BucketSort.js:15:32
     const allBuckets = new Array(bucketCount).fill().map(() => []);
 
     arr.forEach((currentVal) => {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
+        allBuckets[Math.floor((currentVal + minValue) / bucketSize)].push(currentVal);
     });
 
killedBy: Bucket Sort Tests sort array with single elements
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArithmeticOperator
src/Algorithms/BucketSort.js:15:31
     const allBuckets = new Array(bucketCount).fill().map(() => []);
 
     arr.forEach((currentVal) => {
-        allBuckets[Math.floor((currentVal - minValue) / bucketSize)].push(currentVal);
+        allBuckets[Math.floor((currentVal - minValue) * bucketSize)].push(currentVal);
     });
 
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/Algorithms/BucketSort.js:19:36
     });
 
     arr.length = 0;
-    allBuckets.forEach((bucket) => {
-        insertionSort(bucket);
-        arr.push(...bucket);
-    });
+    allBuckets.forEach((bucket) => {});
 
     return arr;
killedBy: Bucket Sort Tests sort array with single elements
statusReason: expected [] to deeply equal [ 4 ]
