[Timeout] BlockStatement
src/Algorithms/CombSort.js:2:38
 export const combSort = (arr) => {
-    const is_array_sorted = (arr) => {
-        var sorted = true;
-        for (var i = 0; i < arr.length - 1; i++) {
-            if (arr[i] > arr[i + 1]) {
-                sorted = false;
-                break;
-            }
-        }
-        return sorted;
-    }
+    const is_array_sorted = (arr) => {}
 
     var iteration_count = 0;

[Timeout] BooleanLiteral
src/Algorithms/CombSort.js:19:12
 
     // Repeat iterations Until array is not sorted
 
-    while (!is_array_sorted(arr)) {
+    while (is_array_sorted(arr)) {
         // If not first gap  Calculate gap
         if (iteration_count > 0)

[Timeout] ConditionalExpression
src/Algorithms/CombSort.js:21:13
 
     while (!is_array_sorted(arr)) {
         // If not first gap  Calculate gap
-        if (iteration_count > 0)
+        if (false)
             gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
 

[Timeout] EqualityOperator
src/Algorithms/CombSort.js:22:20
     while (!is_array_sorted(arr)) {
         // If not first gap  Calculate gap
         if (iteration_count > 0)
-            gap = (gap == 1) ? gap : Math.floor(gap / decrease_factor);
+            gap = (gap != 1) ? gap : Math.floor(gap / decrease_factor);
 
         // Set front and back elements and increment to a gap

[Timeout] BlockStatement
src/Algorithms/CombSort.js:27:40
         // Set front and back elements and increment to a gap
         var front = 0;
         var back = gap;
-        while (back <= arr.length - 1) {
-            // Swap the elements if they are not ordered
-
-            if (arr[front] > arr[back]) {
-                var temp = arr[front];
-                arr[front] = arr[back];
-                arr[back] = temp;
-            }
-
-            // Increment and re-run swapping
-
-            front += 1;
-            back += 1;
-        }
+        while (back <= arr.length - 1) {}
         iteration_count += 1;
     }

[Timeout] ConditionalExpression
src/Algorithms/CombSort.js:30:17
         while (back <= arr.length - 1) {
             // Swap the elements if they are not ordered
 
-            if (arr[front] > arr[back]) {
+            if (false) {
                 var temp = arr[front];
                 arr[front] = arr[back];
