[Killed] BlockStatement
src/Algorithms/CountSort.js:2:35
 
-export const countSort = (arr) => {
-    const n = arr.length;
-    let maxElement = Math.max(...arr);
-    let counts = new Array(maxElement + 1).fill(0);
-    let newArray = [];
-
-    for (let i = 0; i < n; i++) {
-        counts[arr[i]]++;
-    }
-    console.log(counts);
-    for (let i = 0; i <= maxElement; i++) {
-        while (counts[i] > 0) {
-            newArray.push(i);
-            counts[i]--;
-        }
-    }
-
-    return newArray;
-};
+export const countSort = (arr) => {};
 
killedBy: Count Sort sort array with single elements
statusReason: expected undefined to deeply equal [ 4 ]

[Killed] MethodExpression
src/Algorithms/CountSort.js:4:22
 
 export const countSort = (arr) => {
     const n = arr.length;
-    let maxElement = Math.max(...arr);
+    let maxElement = Math.min(...arr);
     let counts = new Array(maxElement + 1).fill(0);
     let newArray = [];
killedBy: Count Sort sort an arbitary array
statusReason: expected [ 1 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/CountSort.js:5:28
 export const countSort = (arr) => {
     const n = arr.length;
     let maxElement = Math.max(...arr);
-    let counts = new Array(maxElement + 1).fill(0);
+    let counts = new Array(maxElement - 1).fill(0);
     let newArray = [];
 
killedBy: Count Sort sort array with single elements
statusReason: expected [] to deeply equal [ 4 ]

[Killed] ArrayDeclaration
src/Algorithms/CountSort.js:6:20
     const n = arr.length;
     let maxElement = Math.max(...arr);
     let counts = new Array(maxElement + 1).fill(0);
-    let newArray = [];
+    let newArray = ["Stryker was here"];
 
     for (let i = 0; i < n; i++) {
killedBy: Count Sort sort array with single elements
statusReason: expected [ 'Stryker was here', 4 ] to deeply equal [ 4 ]

[Killed] BlockStatement
src/Algorithms/CountSort.js:12:43
         counts[arr[i]]++;
     }
     console.log(counts);
-    for (let i = 0; i <= maxElement; i++) {
-        while (counts[i] > 0) {
-            newArray.push(i);
-            counts[i]--;
-        }
-    }
+    for (let i = 0; i <= maxElement; i++) {}
 
     return newArray;
killedBy: Count Sort sort array with single elements
statusReason: expected [] to deeply equal [ 4 ]

[Killed] ConditionalExpression
src/Algorithms/CountSort.js:12:21
         counts[arr[i]]++;
     }
     console.log(counts);
-    for (let i = 0; i <= maxElement; i++) {
+    for (let i = 0; false; i++) {
         while (counts[i] > 0) {
             newArray.push(i);
killedBy: Count Sort sort array with single elements
statusReason: expected [] to deeply equal [ 4 ]

[Timeout] UpdateOperator
src/Algorithms/CountSort.js:15:13
     for (let i = 0; i <= maxElement; i++) {
         while (counts[i] > 0) {
             newArray.push(i);
-            counts[i]--;
+            counts[i]++;
         }
     }
