[Killed] BlockStatement
src/Algorithms/HeapSort.js:4:36
 export const heapSort = (arr) => {
     const N = arr.length;
 
-    const heapify = (arr, N, i) => {
-        let largest = i;
-        const left = 2 * i + 1;
-        const right = 2 * i + 2;
-
-        if (left < N && arr[left] > arr[largest]) {
-            largest = left;
-        }
-
-        if (right < N && arr[right] > arr[largest]) {
-            largest = right;
-        }
-
-        if (largest !== i) {
-            [arr[i], arr[largest]] = [arr[largest], arr[i]];
-            heapify(arr, N, largest);
-        }
-    };
+    const heapify = (arr, N, i) => {};
 
     for (let i = Math.floor(N / 2) - 1; i >= 0; i--) {
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 3, 1, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/HeapSort.js:6:22
 
     const heapify = (arr, N, i) => {
         let largest = i;
-        const left = 2 * i + 1;
+        const left = 2 / i + 1;
         const right = 2 * i + 2;
 
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 8, 1, 3, 3, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/HeapSort.js:6:22
 
     const heapify = (arr, N, i) => {
         let largest = i;
-        const left = 2 * i + 1;
+        const left = 2 * i - 1;
         const right = 2 * i + 2;
 
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 8, 1, 3, 3, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Survived] ArithmeticOperator
src/Algorithms/HeapSort.js:7:23
     const heapify = (arr, N, i) => {
         let largest = i;
         const left = 2 * i + 1;
-        const right = 2 * i + 2;
+        const right = 2 / i + 2;
 
         if (left < N && arr[left] > arr[largest]) {

[Timeout] ArithmeticOperator
src/Algorithms/HeapSort.js:7:23
     const heapify = (arr, N, i) => {
         let largest = i;
         const left = 2 * i + 1;
-        const right = 2 * i + 2;
+        const right = 2 * i - 2;
 
         if (left < N && arr[left] > arr[largest]) {

[Killed] EqualityOperator
src/Algorithms/HeapSort.js:9:13
         const left = 2 * i + 1;
         const right = 2 * i + 2;
 
-        if (left < N && arr[left] > arr[largest]) {
+        if (left <= N && arr[left] > arr[largest]) {
             largest = left;
         }
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 3, 1, 3, 4, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/HeapSort.js:9:13
         const left = 2 * i + 1;
         const right = 2 * i + 2;
 
-        if (left < N && arr[left] > arr[largest]) {
+        if (left >= N && arr[left] > arr[largest]) {
             largest = left;
         }
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 8, 1, 3, 3, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/HeapSort.js:13:53
             largest = left;
         }
 
-        if (right < N && arr[right] > arr[largest]) {
-            largest = right;
-        }
+        if (right < N && arr[right] > arr[largest]) {}
 
         if (largest !== i) {
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/HeapSort.js:13:13
             largest = left;
         }
 
-        if (right < N && arr[right] > arr[largest]) {
+        if (false) {
             largest = right;
         }
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/HeapSort.js:17:28
             largest = right;
         }
 
-        if (largest !== i) {
-            [arr[i], arr[largest]] = [arr[largest], arr[i]];
-            heapify(arr, N, largest);
-        }
+        if (largest !== i) {}
     };
 
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 3, 1, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/HeapSort.js:17:13
             largest = right;
         }
 
-        if (largest !== i) {
+        if (false) {
             [arr[i], arr[largest]] = [arr[largest], arr[i]];
             heapify(arr, N, largest);
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 3, 1, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/HeapSort.js:23:41
         }
     };
 
-    for (let i = Math.floor(N / 2) - 1; i >= 0; i--) {
+    for (let i = Math.floor(N / 2) - 1; i > 0; i--) {
         heapify(arr, N, i);
     }
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/HeapSort.js:23:41
         }
     };
 
-    for (let i = Math.floor(N / 2) - 1; i >= 0; i--) {
+    for (let i = Math.floor(N / 2) - 1; false; i--) {
         heapify(arr, N, i);
     }
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 3, 8, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/HeapSort.js:27:18
         heapify(arr, N, i);
     }
 
-    for (let i = N - 1; i > 0; i--) {
+    for (let i = N + 1; i > 0; i--) {
         [arr[0], arr[i]] = [arr[i], arr[0]];
         heapify(arr, i, 0);
killedBy: Heap Sort Tests sort array with single elements
statusReason: expected [ undefined, undefined, 4 ] to deeply equal [ 4 ]

[Killed] ConditionalExpression
src/Algorithms/HeapSort.js:27:25
         heapify(arr, N, i);
     }
 
-    for (let i = N - 1; i > 0; i--) {
+    for (let i = N - 1; false; i--) {
         [arr[0], arr[i]] = [arr[i], arr[0]];
         heapify(arr, i, 0);
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ 8, 4, 1, 3, 3 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArrayDeclaration
src/Algorithms/HeapSort.js:28:28
     }
 
     for (let i = N - 1; i > 0; i--) {
-        [arr[0], arr[i]] = [arr[i], arr[0]];
+        [arr[0], arr[i]] = [];
         heapify(arr, i, 0);
     }
killedBy: Heap Sort Tests sort an arbitary array
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ 1, 3, 3, 4, 8 ]
