[Killed] BlockStatement
src/Algorithms/InsertionSort.js:1:39
-export const insertionSort = (arr) => {
-    const length = arr.length;
-    for (let i = 1; i < length; i++) {
-        const current = arr[i];
-        let j;
-
-        for (j = i - 1; j >= 0 && arr[j] > current; j--) {
-            arr[j + 1] = arr[j];
-        }
-
-        arr[j + 1] = current;
-    }
-
-    return arr;
-};
+export const insertionSort = (arr) => {};
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/InsertionSort.js:3:21
 export const insertionSort = (arr) => {
     const length = arr.length;
-    for (let i = 1; i < length; i++) {
+    for (let i = 1; false; i++) {
         const current = arr[i];
         let j;
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/InsertionSort.js:3:38
 export const insertionSort = (arr) => {
     const length = arr.length;
-    for (let i = 1; i < length; i++) {
-        const current = arr[i];
-        let j;
-
-        for (j = i - 1; j >= 0 && arr[j] > current; j--) {
-            arr[j + 1] = arr[j];
-        }
-
-        arr[j + 1] = current;
-    }
+    for (let i = 1; i < length; i++) {}
 
     return arr;
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/InsertionSort.js:7:25
         const current = arr[i];
         let j;
 
-        for (j = i - 1; j >= 0 && arr[j] > current; j--) {
+        for (j = i - 1; false; j--) {
             arr[j + 1] = arr[j];
         }
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/InsertionSort.js:7:58
         const current = arr[i];
         let j;
 
-        for (j = i - 1; j >= 0 && arr[j] > current; j--) {
-            arr[j + 1] = arr[j];
-        }
+        for (j = i - 1; j >= 0 && arr[j] > current; j--) {}
 
         arr[j + 1] = current;
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/InsertionSort.js:8:17
         let j;
 
         for (j = i - 1; j >= 0 && arr[j] > current; j--) {
-            arr[j + 1] = arr[j];
+            arr[j - 1] = arr[j];
         }
 
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/InsertionSort.js:11:13
             arr[j + 1] = arr[j];
         }
 
-        arr[j + 1] = current;
+        arr[j - 1] = current;
     }
 
killedBy: Bucket Sort Tests sort an arbitary array
statusReason: expected [ 4, 4, 4, 4, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]
