[Killed] BlockStatement
src/Algorithms/MergeSort.js:1:35
-export const mergeSort = (arr) => {
-    if (arr.length <= 1) {
-        return arr;
-    }
-
-    const merge = (left, right) => {
-        let resultArray = [], leftIndex = 0, rightIndex = 0;
-
-        while (leftIndex < left.length && rightIndex < right.length) {
-            if (left[leftIndex] < right[rightIndex]) {
-                resultArray.push(left[leftIndex++]);
-            } else {
-                resultArray.push(right[rightIndex++]);
-            }
-        }
-
-        return resultArray.concat(left.slice(leftIndex), right.slice(rightIndex));
-    };
-
-    const middle = Math.floor(arr.length / 2);
-    const left = arr.slice(0, middle);
-    const right = arr.slice(middle);
-
-    return merge(mergeSort(left), mergeSort(right));
-};
+export const mergeSort = (arr) => {};
killedBy: Merge Sort Tests sort array with single elements
statusReason: expected undefined to deeply equal [ 4 ]

[Killed] ConditionalExpression
src/Algorithms/MergeSort.js:2:9
 export const mergeSort = (arr) => {
-    if (arr.length <= 1) {
+    if (true) {
         return arr;
     }
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Timeout] EqualityOperator
src/Algorithms/MergeSort.js:2:9
 export const mergeSort = (arr) => {
-    if (arr.length <= 1) {
+    if (arr.length > 1) {
         return arr;
     }

[Killed] BlockStatement
src/Algorithms/MergeSort.js:6:36
         return arr;
     }
 
-    const merge = (left, right) => {
-        let resultArray = [], leftIndex = 0, rightIndex = 0;
-
-        while (leftIndex < left.length && rightIndex < right.length) {
-            if (left[leftIndex] < right[rightIndex]) {
-                resultArray.push(left[leftIndex++]);
-            } else {
-                resultArray.push(right[rightIndex++]);
-            }
-        }
-
-        return resultArray.concat(left.slice(leftIndex), right.slice(rightIndex));
-    };
+    const merge = (left, right) => {};
 
     const middle = Math.floor(arr.length / 2);
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected undefined to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/MergeSort.js:9:43
     const merge = (left, right) => {
         let resultArray = [], leftIndex = 0, rightIndex = 0;
 
-        while (leftIndex < left.length && rightIndex < right.length) {
+        while (leftIndex < left.length && rightIndex >= right.length) {
             if (left[leftIndex] < right[rightIndex]) {
                 resultArray.push(left[leftIndex++]);
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/MergeSort.js:10:17
         let resultArray = [], leftIndex = 0, rightIndex = 0;
 
         while (leftIndex < left.length && rightIndex < right.length) {
-            if (left[leftIndex] < right[rightIndex]) {
+            if (false) {
                 resultArray.push(left[leftIndex++]);
             } else {
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected [ 8, 3, 1, 3, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] UpdateOperator
src/Algorithms/MergeSort.js:11:39
 
         while (leftIndex < left.length && rightIndex < right.length) {
             if (left[leftIndex] < right[rightIndex]) {
-                resultArray.push(left[leftIndex++]);
+                resultArray.push(left[leftIndex--]);
             } else {
                 resultArray.push(right[rightIndex++]);
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 3, 8, 3, 1, 4 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Timeout] BlockStatement
src/Algorithms/MergeSort.js:12:20
         while (leftIndex < left.length && rightIndex < right.length) {
             if (left[leftIndex] < right[rightIndex]) {
                 resultArray.push(left[leftIndex++]);
-            } else {
-                resultArray.push(right[rightIndex++]);
-            }
+            } else {}
         }
 

[Timeout] UpdateOperator
src/Algorithms/MergeSort.js:13:40
             if (left[leftIndex] < right[rightIndex]) {
                 resultArray.push(left[leftIndex++]);
             } else {
-                resultArray.push(right[rightIndex++]);
+                resultArray.push(right[rightIndex--]);
             }
         }

[Killed] MethodExpression
src/Algorithms/MergeSort.js:17:58
             }
         }
 
-        return resultArray.concat(left.slice(leftIndex), right.slice(rightIndex));
+        return resultArray.concat(left.slice(leftIndex), right);
     };
 
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 3, 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] MethodExpression
src/Algorithms/MergeSort.js:17:35
             }
         }
 
-        return resultArray.concat(left.slice(leftIndex), right.slice(rightIndex));
+        return resultArray.concat(left, right.slice(rightIndex));
     };
 
killedBy: Merge Sort Tests sort an arbitary array
statusReason: expected [ 1, 1, 3, 3, 3, 4, 3, 4, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Timeout] ArithmeticOperator
src/Algorithms/MergeSort.js:20:31
         return resultArray.concat(left.slice(leftIndex), right.slice(rightIndex));
     };
 
-    const middle = Math.floor(arr.length / 2);
+    const middle = Math.floor(arr.length * 2);
     const left = arr.slice(0, middle);
     const right = arr.slice(middle);

[Timeout] MethodExpression
src/Algorithms/MergeSort.js:21:18
     };
 
     const middle = Math.floor(arr.length / 2);
-    const left = arr.slice(0, middle);
+    const left = arr;
     const right = arr.slice(middle);
 

[Timeout] MethodExpression
src/Algorithms/MergeSort.js:22:19
 
     const middle = Math.floor(arr.length / 2);
     const left = arr.slice(0, middle);
-    const right = arr.slice(middle);
+    const right = arr;
 
     return merge(mergeSort(left), mergeSort(right));
