[Killed] BooleanLiteral
src/Algorithms/OddEvenSort.js:3:20
 export const oddEvenSort = (arr) => {
     var n = arr.length
-    let isSorted = false;
+    let isSorted = true;
     while (!isSorted) {
         isSorted = true;
killedBy: Odd Even Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BooleanLiteral
src/Algorithms/OddEvenSort.js:4:12
 export const oddEvenSort = (arr) => {
     var n = arr.length
     let isSorted = false;
-    while (!isSorted) {
+    while (isSorted) {
         isSorted = true;
         let temp = 0;
killedBy: Odd Even Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/OddEvenSort.js:4:12
 export const oddEvenSort = (arr) => {
     var n = arr.length
     let isSorted = false;
-    while (!isSorted) {
+    while (false) {
         isSorted = true;
         let temp = 0;
killedBy: Odd Even Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/OddEvenSort.js:9:17
         let temp = 0;
         // Perform Bubble sort on odd indexed element
         for (let i = 1; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
+            if (arr[i] <= arr[i + 1]) {
                 temp = arr[i];
                 arr[i] = arr[i + 1];
killedBy: Odd Even Sort Tests sort an arbitary array
statusReason: expected [ 3, 4, 1, 8, 3 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/OddEvenSort.js:17:48
             }
         }
         // Perform Bubble sort on even indexed element
-        for (let i = 0; i <= n - 2; i = i + 2) {
-            if (arr[i] > arr[i + 1]) {
-                temp = arr[i];
-                arr[i] = arr[i + 1];
-                arr[i + 1] = temp;
-                isSorted = false;
-            }
-        }
+        for (let i = 0; i <= n - 2; i = i + 2) {}
     }
     return arr;
killedBy: Odd Even Sort Tests sort an arbitary array
statusReason: expected [ 4, 1, 3, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]
