[Killed] ConditionalExpression
src/Algorithms/PigeonHoleSort.js:2:9
 export const pigeonholeSort = (nums) => {
-    if (nums.length == 0) return [];
+    if (true) return [];
     let min_val = nums[0]
     let max_val = nums[0]
killedBy: Pigeon Hole Sort Tests sort array with single elements
statusReason: expected [] to deeply equal [ 4 ]

[Killed] ConditionalExpression
src/Algorithms/PigeonHoleSort.js:2:9
 export const pigeonholeSort = (nums) => {
-    if (nums.length == 0) return [];
+    if (false) return [];
     let min_val = nums[0]
     let max_val = nums[0]
killedBy: Pigeon Hole Sort Tests sort array with no elements
statusReason: Invalid array length

[Killed] EqualityOperator
src/Algorithms/PigeonHoleSort.js:7:13
     let max_val = nums[0]
 
     for (let i = 0; i < nums.length; i++) {
-        if (nums[i] > max_val) { max_val = nums[i] }
+        if (nums[i] <= max_val) { max_val = nums[i] }
         if (nums[i] < min_val) { min_val = nums[i] }
     }
killedBy: Pigeon Hole Sort Tests sort an arbitary array
statusReason: expected [ 1, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/PigeonHoleSort.js:20:21
 
     let index = 0
 
-    for (let j = 0; j < range; j++) {
+    for (let j = 0; false; j++) {
         while (data[j]-- > 0) {
             nums[index++] = j + min_val
killedBy: Pigeon Hole Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/PigeonHoleSort.js:21:16
     let index = 0
 
     for (let j = 0; j < range; j++) {
-        while (data[j]-- > 0) {
+        while (false) {
             nums[index++] = j + min_val
         }
killedBy: Pigeon Hole Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]
