[Killed] BlockStatement
src/Algorithms/QuickSort.js:3:44
 
 export const quickSort = (arr) => {
-    const partition = (arr, start, end) => {
-        const pivot = arr[end];
-        let p = start;
-
-        for (let i = start; i < end; i++) {
-            if (arr[i] <= pivot) {
-                [arr[i], arr[p]] = [arr[p], arr[i]];
-                p++;
-            }
-        }
-
-        [arr[p], arr[end]] = [arr[end], arr[p]];
-        return p;
-    };
+    const partition = (arr, start, end) => {};
 
     const quicksort = (arr, start, end) => {
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/QuickSort.js:7:29
         const pivot = arr[end];
         let p = start;
 
-        for (let i = start; i < end; i++) {
+        for (let i = start; false; i++) {
             if (arr[i] <= pivot) {
                 [arr[i], arr[p]] = [arr[p], arr[i]];
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 8, 4, 3, 1, 3 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] EqualityOperator
src/Algorithms/QuickSort.js:7:29
         const pivot = arr[end];
         let p = start;
 
-        for (let i = start; i < end; i++) {
+        for (let i = start; i >= end; i++) {
             if (arr[i] <= pivot) {
                 [arr[i], arr[p]] = [arr[p], arr[i]];
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 8, 4, 3, 1, 3 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/QuickSort.js:8:34
         let p = start;
 
         for (let i = start; i < end; i++) {
-            if (arr[i] <= pivot) {
-                [arr[i], arr[p]] = [arr[p], arr[i]];
-                p++;
-            }
+            if (arr[i] <= pivot) {}
         }
 
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 8, 4, 3, 1, 3 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArrayDeclaration
src/Algorithms/QuickSort.js:9:36
 
         for (let i = start; i < end; i++) {
             if (arr[i] <= pivot) {
-                [arr[i], arr[p]] = [arr[p], arr[i]];
+                [arr[i], arr[p]] = [];
                 p++;
             }
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] UpdateOperator
src/Algorithms/QuickSort.js:10:17
         for (let i = start; i < end; i++) {
             if (arr[i] <= pivot) {
                 [arr[i], arr[p]] = [arr[p], arr[i]];
-                p++;
+                p--;
             }
         }
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ undefined, undefined, …(3), …(9) ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArrayDeclaration
src/Algorithms/QuickSort.js:14:30
             }
         }
 
-        [arr[p], arr[end]] = [arr[end], arr[p]];
+        [arr[p], arr[end]] = [];
         return p;
     };
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ undefined, undefined, …(3) ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/QuickSort.js:18:44
         return p;
     };
 
-    const quicksort = (arr, start, end) => {
-        if (start < end) {
-            const p = partition(arr, start, end);
-            quicksort(arr, start, p - 1);
-            quicksort(arr, p + 1, end);
-        }
-    };
+    const quicksort = (arr, start, end) => {};
 
     quicksort(arr, 0, arr.length - 1);
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/QuickSort.js:19:13
     };
 
     const quicksort = (arr, start, end) => {
-        if (start < end) {
+        if (false) {
             const p = partition(arr, start, end);
             quicksort(arr, start, p - 1);
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/QuickSort.js:19:26
     };
 
     const quicksort = (arr, start, end) => {
-        if (start < end) {
-            const p = partition(arr, start, end);
-            quicksort(arr, start, p - 1);
-            quicksort(arr, p + 1, end);
-        }
+        if (start < end) {}
     };
 
killedBy: Quick Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Timeout] ArithmeticOperator
src/Algorithms/QuickSort.js:21:35
     const quicksort = (arr, start, end) => {
         if (start < end) {
             const p = partition(arr, start, end);
-            quicksort(arr, start, p - 1);
+            quicksort(arr, start, p + 1);
             quicksort(arr, p + 1, end);
         }

[Timeout] ArithmeticOperator
src/Algorithms/QuickSort.js:22:28
         if (start < end) {
             const p = partition(arr, start, end);
             quicksort(arr, start, p - 1);
-            quicksort(arr, p + 1, end);
+            quicksort(arr, p - 1, end);
         }
     };

[Killed] ArithmeticOperator
src/Algorithms/QuickSort.js:26:23
         }
     };
 
-    quicksort(arr, 0, arr.length - 1);
+    quicksort(arr, 0, arr.length + 1);
     return arr;
 };
killedBy: Quick Sort Tests sort array with single elements
statusReason: expected [ undefined, 4, undefined ] to deeply equal [ 4 ]
