[Killed] BlockStatement
src/Algorithms/SelectionSort.js:1:39
-export const selectionSort = (arr) => {
-    const length = arr.length;
-
-    for (let i = 0; i < length; i++) {
-        let minIndex = i;
-
-        for (let j = i + 1; j < length; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
-
-        if (minIndex !== i) {
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
-    }
-
-    return arr;
-};
+export const selectionSort = (arr) => {};
killedBy: Selection Sort Tests sort array with single elements
statusReason: expected undefined to deeply equal [ 4 ]

[Killed] BlockStatement
src/Algorithms/SelectionSort.js:4:38
 export const selectionSort = (arr) => {
     const length = arr.length;
 
-    for (let i = 0; i < length; i++) {
-        let minIndex = i;
-
-        for (let j = i + 1; j < length; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
-
-        if (minIndex !== i) {
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
-    }
+    for (let i = 0; i < length; i++) {}
 
     return arr;
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ArithmeticOperator
src/Algorithms/SelectionSort.js:7:22
     for (let i = 0; i < length; i++) {
         let minIndex = i;
 
-        for (let j = i + 1; j < length; j++) {
+        for (let j = i - 1; j < length; j++) {
             if (arr[j] < arr[minIndex]) {
                 minIndex = j;
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 3, 4, 3, 8, 1 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/SelectionSort.js:7:46
     for (let i = 0; i < length; i++) {
         let minIndex = i;
 
-        for (let j = i + 1; j < length; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
-        }
+        for (let j = i + 1; j < length; j++) {}
 
         if (minIndex !== i) {
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/SelectionSort.js:8:41
         let minIndex = i;
 
         for (let j = i + 1; j < length; j++) {
-            if (arr[j] < arr[minIndex]) {
-                minIndex = j;
-            }
+            if (arr[j] < arr[minIndex]) {}
         }
 
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/SelectionSort.js:8:17
         let minIndex = i;
 
         for (let j = i + 1; j < length; j++) {
-            if (arr[j] < arr[minIndex]) {
+            if (false) {
                 minIndex = j;
             }
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] ConditionalExpression
src/Algorithms/SelectionSort.js:13:13
             }
         }
 
-        if (minIndex !== i) {
+        if (false) {
             [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
         }
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]

[Killed] BlockStatement
src/Algorithms/SelectionSort.js:13:29
             }
         }
 
-        if (minIndex !== i) {
-            [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-        }
+        if (minIndex !== i) {}
     }
 
killedBy: Selection Sort Tests sort an arbitary array
statusReason: expected [ 4, 3, 1, 3, 8 ] to deeply equal [ 1, 3, 3, 4, 8 ]
