[Killed] BlockStatement
src/Data-Structures/LinkedList.js:6:17
 
 
 export default class LinkedList {
-  constructor() {
-    this.count = 0;
-    this.head = null;
-  }
+  constructor() {}
 
   push(element) {
killedBy: Doubly Linked List Tests .getHead() get the head of linked list
statusReason: expected undefined to equal null

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:11:17
     this.head = null;
   }
 
-  push(element) {
-    const node = new Node(element);
-    let current;
-    if (this.head == null) {
-      this.head = node;
-    } else {
-      current = this.head;
-      while (current.getNext() != null) {
-        current = current.getNext();
-      }
-      current.setNext(node);
-    }
-    this.count++;
-  }
+  push(element) {}
 
   getElementAt(index) {
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:14:9
   push(element) {
     const node = new Node(element);
     let current;
-    if (this.head == null) {
+    if (false) {
       this.head = node;
     } else {
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:14:9
   push(element) {
     const node = new Node(element);
     let current;
-    if (this.head == null) {
+    if (this.head != null) {
       this.head = node;
     } else {
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:16:12
     let current;
     if (this.head == null) {
       this.head = node;
-    } else {
-      current = this.head;
-      while (current.getNext() != null) {
-        current = current.getNext();
-      }
-      current.setNext(node);
-    }
+    } else {}
     this.count++;
   }
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:18:14
       this.head = node;
     } else {
       current = this.head;
-      while (current.getNext() != null) {
+      while (false) {
         current = current.getNext();
       }
killedBy: Linked List Tests .toString() get string of elements if empty
statusReason: expected '1,3' to equal '1,2,3'

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:18:14
       this.head = node;
     } else {
       current = this.head;
-      while (current.getNext() != null) {
+      while (current.getNext() == null) {
         current = current.getNext();
       }
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getNext')

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:26:23
     this.count++;
   }
 
-  getElementAt(index) {
-    if (index < 0 || index >= this.count) {
-      throw new Error('.getElementAt: Index out of bounds error');
-    }
-    let node = this.head;
-    for (let i = 0; i < index && node != null; i++) {
-      node = node.getNext();
-    }
-    return node;
-
-
-  }
+  getElementAt(index) {}
 
   insertAt(element, index) {
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: Cannot read properties of undefined (reading 'getPrev')

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:27:22
   }
 
   getElementAt(index) {
-    if (index < 0 || index >= this.count) {
+    if (index < 0 || index < this.count) {
       throw new Error('.getElementAt: Index out of bounds error');
     }
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: .getElementAt: Index out of bounds error

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:27:22
   }
 
   getElementAt(index) {
-    if (index < 0 || index >= this.count) {
+    if (index < 0 || index > this.count) {
       throw new Error('.getElementAt: Index out of bounds error');
     }
killedBy: Linked List Tests .getElementAt(index) get element if invalid index
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:31:21
       throw new Error('.getElementAt: Index out of bounds error');
     }
     let node = this.head;
-    for (let i = 0; i < index && node != null; i++) {
+    for (let i = 0; false; i++) {
       node = node.getNext();
     }
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: Cannot read properties of null (reading 'setNext')

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:31:21
       throw new Error('.getElementAt: Index out of bounds error');
     }
     let node = this.head;
-    for (let i = 0; i < index && node != null; i++) {
+    for (let i = 0; true && node != null; i++) {
       node = node.getNext();
     }
killedBy: Doubly Linked List Tests .removeAt(index) remove with valid index
statusReason: Cannot read properties of null (reading 'getPrev')

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:39:28
 
   }
 
-  insertAt(element, index) {
-    if (index < 0 || index > this.count) {
-      throw new Error('.insertAt: Index out of bounds error');
-    }
-    const node = new Node(element);
-    if (index === 0) {
-      const current = this.head;
-      node.setNext(current);
-      this.head = node;
-    } else {
-      const previous = this.getElementAt(index - 1);
-      node.setNext(previous.getNext());
-      previous.setNext(node);
-    }
-    this.count++;
-  }
+  insertAt(element, index) {}
 
   removeAt(index) {
killedBy: Linked List Tests .insert(element, index) insert at index 0
statusReason: expected 4 to equal 5

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:40:9
   }
 
   insertAt(element, index) {
-    if (index < 0 || index > this.count) {
+    if (false) {
       throw new Error('.insertAt: Index out of bounds error');
     }
killedBy: Linked List Tests .insert(element, index) insert at invalid index
statusReason: expected Error: .getElementAt: Index out of bounds… to have property 'message' of '.insertAt: Index out of bounds error', but got '.getElementAt: Index out of bounds er…'

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:40:9
   }
 
   insertAt(element, index) {
-    if (index < 0 || index > this.count) {
+    if (false || index > this.count) {
       throw new Error('.insertAt: Index out of bounds error');
     }
killedBy: Linked List Tests .insert(element, index) insert at invalid index
statusReason: expected Error: .getElementAt: Index out of bounds… to have property 'message' of '.insertAt: Index out of bounds error', but got '.getElementAt: Index out of bounds er…'

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:44:9
       throw new Error('.insertAt: Index out of bounds error');
     }
     const node = new Node(element);
-    if (index === 0) {
+    if (true) {
       const current = this.head;
       node.setNext(current);
killedBy: Linked List Tests .insert(element, index) insert at last index
statusReason: expected 4 to equal 5

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:44:9
       throw new Error('.insertAt: Index out of bounds error');
     }
     const node = new Node(element);
-    if (index === 0) {
+    if (false) {
       const current = this.head;
       node.setNext(current);
killedBy: Linked List Tests .insert(element, index) insert at index 0
statusReason: .getElementAt: Index out of bounds error

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:48:12
       const current = this.head;
       node.setNext(current);
       this.head = node;
-    } else {
-      const previous = this.getElementAt(index - 1);
-      node.setNext(previous.getNext());
-      previous.setNext(node);
-    }
+    } else {}
     this.count++;
   }
killedBy: Linked List Tests .insert(element, index) insert at last index
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:56:19
     this.count++;
   }
 
-  removeAt(index) {
-    if (index < 0 || index >= this.count) {
-      throw new Error('.removeAt: Index out of bounds error');
-    }
-    let current = this.head;
-    if (index === 0) {
-      this.head = current.getNext();
-    } else {
-      const previous = this.getElementAt(index - 1);
-      current = previous.getNext();
-      previous.setNext(current.getNext());
-    }
-    this.count--;
-    return current.getElement();
-  }
+  removeAt(index) {}
 
   remove(element) {
killedBy: Linked List Tests .removeAt(index) remove with valid index
statusReason: expected undefined to equal 1

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:57:22
   }
 
   removeAt(index) {
-    if (index < 0 || index >= this.count) {
+    if (index < 0 || index < this.count) {
       throw new Error('.removeAt: Index out of bounds error');
     }
killedBy: Linked List Tests .removeAt(index) remove with valid index
statusReason: .removeAt: Index out of bounds error

[Killed] LogicalOperator
src/Data-Structures/LinkedList.js:57:9
   }
 
   removeAt(index) {
-    if (index < 0 || index >= this.count) {
+    if (index < 0 && index >= this.count) {
       throw new Error('.removeAt: Index out of bounds error');
     }
killedBy: Linked List Tests .removeAt(index) remove with invalid index(pos)
statusReason: expected TypeError: Cannot read properties of null… to have property 'message' of '.removeAt: Index out of bounds error', but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:63:12
     let current = this.head;
     if (index === 0) {
       this.head = current.getNext();
-    } else {
-      const previous = this.getElementAt(index - 1);
-      current = previous.getNext();
-      previous.setNext(current.getNext());
-    }
+    } else {}
     this.count--;
     return current.getElement();
killedBy: Linked List Tests .removeAt(index) remove with valid index
statusReason: expected 2 to equal 3

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:72:19
     return current.getElement();
   }
 
-  remove(element) {
-    const index = this.indexOf(element);
-    if(index === -1){
-      throw new Error('.remove: Element not found');
-    }
-    return this.removeAt(index);
-  }
+  remove(element) {}
 
   indexOf(element) {
killedBy: Linked List Tests .remove(element) remove with element present
statusReason: expected 4 to equal 3

[Killed] UnaryOperator
src/Data-Structures/LinkedList.js:74:18
 
   remove(element) {
     const index = this.indexOf(element);
-    if(index === -1){
+    if(index === +1){
       throw new Error('.remove: Element not found');
     }
killedBy: Linked List Tests .remove(element) remove with element present
statusReason: .remove: Element not found

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:74:8
 
   remove(element) {
     const index = this.indexOf(element);
-    if(index === -1){
+    if(false){
       throw new Error('.remove: Element not found');
     }
killedBy: Linked List Tests .remove(element) remove with element not present
statusReason: expected Error: .removeAt: Index out of bounds err… to have property 'message' of '.remove: Element not found', but got '.removeAt: Index out of bounds error'

[Killed] StringLiteral
src/Data-Structures/LinkedList.js:75:23
   remove(element) {
     const index = this.indexOf(element);
     if(index === -1){
-      throw new Error('.remove: Element not found');
+      throw new Error("");
     }
     return this.removeAt(index);
killedBy: Linked List Tests .remove(element) remove with element not present
statusReason: expected Error to have property 'message' of '.remove: Element not found', but got ''

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:80:20
     return this.removeAt(index);
   }
 
-  indexOf(element) {
-    let current = this.head;
-    for (let i = 0; i < this.size() && current != null; i++) {
-      if (element === current.getElement()) {
-        return i;
-      }
-      current = current.getNext();
-    }
-    return -1;
-  }
+  indexOf(element) {}
 
   isEmpty() {
killedBy: Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected undefined to equal 1

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:82:40
 
   indexOf(element) {
     let current = this.head;
-    for (let i = 0; i < this.size() && current != null; i++) {
+    for (let i = 0; i < this.size() && current == null; i++) {
       if (element === current.getElement()) {
         return i;
killedBy: Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected -1 to equal 1

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:82:21
 
   indexOf(element) {
     let current = this.head;
-    for (let i = 0; i < this.size() && current != null; i++) {
+    for (let i = 0; false; i++) {
       if (element === current.getElement()) {
         return i;
killedBy: Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected -1 to equal 1

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:83:11
   indexOf(element) {
     let current = this.head;
     for (let i = 0; i < this.size() && current != null; i++) {
-      if (element === current.getElement()) {
+      if (false) {
         return i;
       }
killedBy: Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected -1 to equal 1

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:83:11
   indexOf(element) {
     let current = this.head;
     for (let i = 0; i < this.size() && current != null; i++) {
-      if (element === current.getElement()) {
+      if (true) {
         return i;
       }
killedBy: Linked List Tests .indexOf(element) get index of element with element in list
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:103:11
     return this.head;
   }
 
-  clear() {
-    this.head = null;
-    this.count = 0;
-  }
+  clear() {}
 
   toString() {
killedBy: Doubly Linked List Tests .clear() clear the linked list
statusReason: expected DoublyNode{ element: 1, …(2) } to equal null

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:108:14
     this.count = 0;
   }
 
-  toString() {
-    if (this.head == null) {
-      return '';
-    }
-    let objString = `${this.head.getElement()}`;
-    let current = this.head.getNext();
-    for (let i = 1; i < this.size() && current != null; i++) {
-      objString = `${objString},${current.getElement()}`;
-      current = current.getNext();
-    }
-    return objString;
-  }
+  toString() {}
 }
killedBy: Linked List Tests .toString() get string of elements if empty
statusReason: expected undefined to equal '1,2,3'

[Killed] ConditionalExpression
src/Data-Structures/LinkedList.js:109:9
   }
 
   toString() {
-    if (this.head == null) {
+    if (false) {
       return '';
     }
killedBy: Linked List Tests .toString() get string of elements if non-empty
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:109:28
   }
 
   toString() {
-    if (this.head == null) {
-      return '';
-    }
+    if (this.head == null) {}
     let objString = `${this.head.getElement()}`;
     let current = this.head.getNext();
killedBy: Linked List Tests .toString() get string of elements if non-empty
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] StringLiteral
src/Data-Structures/LinkedList.js:112:21
     if (this.head == null) {
       return '';
     }
-    let objString = `${this.head.getElement()}`;
+    let objString = ``;
     let current = this.head.getNext();
     for (let i = 1; i < this.size() && current != null; i++) {
killedBy: Linked List Tests .toString() get string of elements if empty
statusReason: expected ',2,3' to equal '1,2,3'

[Killed] BlockStatement
src/Data-Structures/LinkedList.js:114:62
     }
     let objString = `${this.head.getElement()}`;
     let current = this.head.getNext();
-    for (let i = 1; i < this.size() && current != null; i++) {
-      objString = `${objString},${current.getElement()}`;
-      current = current.getNext();
-    }
+    for (let i = 1; i < this.size() && current != null; i++) {}
     return objString;
   }
killedBy: Linked List Tests .toString() get string of elements if empty
statusReason: expected '1' to equal '1,2,3'

[Killed] EqualityOperator
src/Data-Structures/LinkedList.js:114:21
     }
     let objString = `${this.head.getElement()}`;
     let current = this.head.getNext();
-    for (let i = 1; i < this.size() && current != null; i++) {
+    for (let i = 1; i >= this.size() && current != null; i++) {
       objString = `${objString},${current.getElement()}`;
       current = current.getNext();
killedBy: Linked List Tests .toString() get string of elements if empty
statusReason: expected '1' to equal '1,2,3'
