[Killed] BlockStatement
src/Data-Structures/Queue.js:2:19
 export default class Queue {
-    constructor() {
-        this.count = 0;
-        this.lowestCount = 0;
-        this.items = {};
-    }
+    constructor() {}
 
     enqueue(element) {
killedBy: Queue Tests .enqueue(element) enqueue element to queue
statusReason: Cannot set properties of undefined (setting 'undefined')

[Killed] BlockStatement
src/Data-Structures/Queue.js:8:22
         this.items = {};
     }
 
-    enqueue(element) {
-        this.items[this.count] = element;
-        this.count++;
-    }
+    enqueue(element) {}
 
     dequeue() {
killedBy: Queue Tests .enqueue(element) enqueue element to queue
statusReason: expected null to equal 4

[Killed] UpdateOperator
src/Data-Structures/Queue.js:10:9
 
     enqueue(element) {
         this.items[this.count] = element;
-        this.count++;
+        this.count--;
     }
 
killedBy: Queue Tests .size() get size of non-empty queue
statusReason: expected -3 to equal 3

[Killed] BlockStatement
src/Data-Structures/Queue.js:13:15
         this.count++;
     }
 
-    dequeue() {
-        if (this.isEmpty()) {
-            throw new Error('.dequeue(): Cannot dequeue from empty queue')
-        }
-        const result = this.items[this.lowestCount];
-        delete this.items[this.lowestCount];
-        this.lowestCount++;
-        return result;
-    }
+    dequeue() {}
 
     peek() {
killedBy: Queue Tests .dequeue() dequeue from non-empty queue
statusReason: expected undefined to equal 4

[Killed] BlockStatement
src/Data-Structures/Queue.js:14:29
     }
 
     dequeue() {
-        if (this.isEmpty()) {
-            throw new Error('.dequeue(): Cannot dequeue from empty queue')
-        }
+        if (this.isEmpty()) {}
         const result = this.items[this.lowestCount];
         delete this.items[this.lowestCount];
killedBy: Queue Tests .dequeue() dequeue from empty queue
statusReason: expected [Function] to throw Error

[Killed] UpdateOperator
src/Data-Structures/Queue.js:19:9
         }
         const result = this.items[this.lowestCount];
         delete this.items[this.lowestCount];
-        this.lowestCount++;
+        this.lowestCount--;
         return result;
     }
killedBy: Queue Tests .dequeue() dequeue from non-empty queue
statusReason: expected 4 to equal 2

[Killed] BlockStatement
src/Data-Structures/Queue.js:23:12
         return result;
     }
 
-    peek() {
-        if (this.isEmpty()) {
-            return null;
-        }
-        return this.items[this.lowestCount];
-    }
+    peek() {}
 
     isEmpty() {
killedBy: Queue Tests .enqueue(element) enqueue element to queue
statusReason: expected undefined to equal 4

[Killed] BlockStatement
src/Data-Structures/Queue.js:34:13
         return this.size() === 0;
     }
 
-    clear() {
-        this.items = {};
-        this.count = 0;
-        this.lowestCount = 0;
-    }
+    clear() {}
 
     size() {
killedBy: Queue Tests .clear() clear a queue
statusReason: expected false to equal true

[Killed] BlockStatement
src/Data-Structures/Queue.js:40:12
         this.lowestCount = 0;
     }
 
-    size() {
-        return (this.count - this.lowestCount);
-    }
+    size() {}
 
     toString() {
killedBy: Queue Tests .size() get size of non-empty queue
statusReason: expected undefined to equal 3

[Killed] ArithmeticOperator
src/Data-Structures/Queue.js:41:17
     }
 
     size() {
-        return (this.count - this.lowestCount);
+        return (this.count + this.lowestCount);
     }
 
killedBy: Queue Tests .dequeue() dequeue from non-empty queue
statusReason: expected 4 to equal 2

[Killed] BlockStatement
src/Data-Structures/Queue.js:44:16
         return (this.count - this.lowestCount);
     }
 
-    toString() {
-        if (this.isEmpty()) {
-            return '';
-        }
-        let objString = `${this.items[this.lowestCount]}`;
-        for (let i = this.lowestCount + 1; i < this.count; i++) {
-            objString = `${objString},${this.items[i]}`;
-        }
-        return objString;
-    }
+    toString() {}
 }
killedBy: Queue Tests .toString() get string from non-empty queue
statusReason: expected undefined to equal '4,5,6'

[Killed] BlockStatement
src/Data-Structures/Queue.js:45:29
     }
 
     toString() {
-        if (this.isEmpty()) {
-            return '';
-        }
+        if (this.isEmpty()) {}
         let objString = `${this.items[this.lowestCount]}`;
         for (let i = this.lowestCount + 1; i < this.count; i++) {
killedBy: Queue Tests .toString() get string from empty queue
statusReason: expected 'undefined' to equal ''

[Killed] ConditionalExpression
src/Data-Structures/Queue.js:45:13
     }
 
     toString() {
-        if (this.isEmpty()) {
+        if (false) {
             return '';
         }
killedBy: Queue Tests .toString() get string from empty queue
statusReason: expected 'undefined' to equal ''

[Killed] StringLiteral
src/Data-Structures/Queue.js:46:20
 
     toString() {
         if (this.isEmpty()) {
-            return '';
+            return "Stryker was here!";
         }
         let objString = `${this.items[this.lowestCount]}`;
killedBy: Queue Tests .toString() get string from empty queue
statusReason: expected 'Stryker was here!' to equal ''

[Killed] EqualityOperator
src/Data-Structures/Queue.js:49:44
             return '';
         }
         let objString = `${this.items[this.lowestCount]}`;
-        for (let i = this.lowestCount + 1; i < this.count; i++) {
+        for (let i = this.lowestCount + 1; i <= this.count; i++) {
             objString = `${objString},${this.items[i]}`;
         }
killedBy: Queue Tests .toString() get string from non-empty queue
statusReason: expected '4,5,6,undefined' to equal '4,5,6'

[Killed] ConditionalExpression
src/Data-Structures/Queue.js:49:44
             return '';
         }
         let objString = `${this.items[this.lowestCount]}`;
-        for (let i = this.lowestCount + 1; i < this.count; i++) {
+        for (let i = this.lowestCount + 1; false; i++) {
             objString = `${objString},${this.items[i]}`;
         }
killedBy: Queue Tests .toString() get string from non-empty queue
statusReason: expected '4' to equal '4,5,6'
