[Killed] BlockStatement
src/Data-Structures/Stack.js:4:19
 
 
 export default class Stack {
-    constructor() {
-        this.count = 0;
-        this.items = {};
-    }
+    constructor() {}
 
     push(element) {
killedBy: Stack Tests .push(element) push element to stack
statusReason: Cannot set properties of undefined (setting 'undefined')

[Killed] BlockStatement
src/Data-Structures/Stack.js:9:19
         this.items = {};
     }
 
-    push(element) {
-        this.items[this.count] = element;
-        this.count++;
-    }
+    push(element) {}
 
     pop() {
killedBy: Stack Tests .push(element) push element to stack
statusReason: expected null to equal 1

[Killed] BlockStatement
src/Data-Structures/Stack.js:14:11
         this.count++;
     }
 
-    pop() {
-        if (this.isEmpty()) {
-            throw new Error('.pop(): Cannot pop from empty stack')
-        }
-        this.count--;
-        const result = this.items[this.count];
-        delete this.items[this.count];
-        return result;
-    }
+    pop() {}
 
     peek() {
killedBy: Stack Tests .pop() pop from non-empty stack
statusReason: expected undefined to equal 3

[Killed] BlockStatement
src/Data-Structures/Stack.js:15:29
     }
 
     pop() {
-        if (this.isEmpty()) {
-            throw new Error('.pop(): Cannot pop from empty stack')
-        }
+        if (this.isEmpty()) {}
         this.count--;
         const result = this.items[this.count];
killedBy: Stack Tests .pop() pop from empty stack
statusReason: expected [Function] to throw Error

[Killed] ConditionalExpression
src/Data-Structures/Stack.js:15:13
     }
 
     pop() {
-        if (this.isEmpty()) {
+        if (true) {
             throw new Error('.pop(): Cannot pop from empty stack')
         }
killedBy: Stack Tests .pop() pop from non-empty stack
statusReason: .pop(): Cannot pop from empty stack

[Killed] BlockStatement
src/Data-Structures/Stack.js:24:12
         return result;
     }
 
-    peek() {
-        if (this.isEmpty()) {
-            return(null);
-        }
-        return this.items[this.count - 1];
-    }
+    peek() {}
 
     isEmpty() {
killedBy: Stack Tests .push(element) push element to stack
statusReason: expected undefined to equal 1

[Killed] ArithmeticOperator
src/Data-Structures/Stack.js:28:27
         if (this.isEmpty()) {
             return(null);
         }
-        return this.items[this.count - 1];
+        return this.items[this.count + 1];
     }
 
killedBy: Stack Tests .push(element) push element to stack
statusReason: expected undefined to equal 1

[Killed] BlockStatement
src/Data-Structures/Stack.js:31:15
         return this.items[this.count - 1];
     }
 
-    isEmpty() {
-        return this.count === 0;
-    }
+    isEmpty() {}
 
     size() {
killedBy: Stack Tests .isEmpty() check emptiness of non-empty stack
statusReason: expected undefined to equal false

[Killed] ConditionalExpression
src/Data-Structures/Stack.js:32:16
     }
 
     isEmpty() {
-        return this.count === 0;
+        return true;
     }
 
killedBy: Stack Tests .push(element) push element to stack
statusReason: expected null to equal 1

[Killed] ConditionalExpression
src/Data-Structures/Stack.js:32:16
     }
 
     isEmpty() {
-        return this.count === 0;
+        return false;
     }
 
killedBy: Stack Tests .isEmpty() check emptiness of non-empty stack
statusReason: expected false to equal true

[Killed] BlockStatement
src/Data-Structures/Stack.js:39:13
         return this.count;
     }
 
-    clear() {
-        this.items = {};
-        this.count = 0;
-    }
+    clear() {}
 
     toString() {
killedBy: Stack Tests .clear() clear a stack
statusReason: expected false to equal true

[Killed] BlockStatement
src/Data-Structures/Stack.js:44:16
         this.count = 0;
     }
 
-    toString() {
-        if (this.isEmpty()) {
-            return '';
-        }
-        let objString = `${this.items[0]}`;
-        for (let i = 1; i < this.count; i++) {
-            objString = `${objString},${this.items[i]}`;
-        }
-        return objString;
-    }
+    toString() {}
 }
killedBy: Stack Tests .toString() get string from non-empty stack
statusReason: expected undefined to equal '1,2,3'

[Killed] StringLiteral
src/Data-Structures/Stack.js:48:25
         if (this.isEmpty()) {
             return '';
         }
-        let objString = `${this.items[0]}`;
+        let objString = ``;
         for (let i = 1; i < this.count; i++) {
             objString = `${objString},${this.items[i]}`;
killedBy: Stack Tests .toString() get string from non-empty stack
statusReason: expected ',2,3' to equal '1,2,3'

[Killed] EqualityOperator
src/Data-Structures/Stack.js:49:25
             return '';
         }
         let objString = `${this.items[0]}`;
-        for (let i = 1; i < this.count; i++) {
+        for (let i = 1; i >= this.count; i++) {
             objString = `${objString},${this.items[i]}`;
         }
killedBy: Stack Tests .toString() get string from non-empty stack
statusReason: expected '1' to equal '1,2,3'

[Killed] BlockStatement
src/Data-Structures/Stack.js:49:46
             return '';
         }
         let objString = `${this.items[0]}`;
-        for (let i = 1; i < this.count; i++) {
-            objString = `${objString},${this.items[i]}`;
-        }
+        for (let i = 1; i < this.count; i++) {}
         return objString;
     }
killedBy: Stack Tests .toString() get string from non-empty stack
statusReason: expected '1' to equal '1,2,3'
