[Killed] BlockStatement
src/models/LinkedListModels.js:2:37
 export class Node {
-  constructor(element, next = null) {
-    this.element = element;
-    this.next = next;
-  }
+  constructor(element, next = null) {}
   setElement(element) {
     this.element = element;
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: expected undefined to equal 1

[Killed] BlockStatement
src/models/LinkedListModels.js:6:23
     this.element = element;
     this.next = next;
   }
-  setElement(element) {
-    this.element = element;
-    return this;
-  }
+  setElement(element) {}
 
   getElement() {
killedBy: Linked List Node Tests .setElement() set the value of node
statusReason: expected 4 to equal 8

[Killed] BlockStatement
src/models/LinkedListModels.js:11:16
     return this;
   }
 
-  getElement() {
-    return this.element;
-  }
+  getElement() {}
 
   setNext(next) {
killedBy: Linked List Tests .push(element) insert node at end
statusReason: expected undefined to equal 1

[Killed] BlockStatement
src/models/LinkedListModels.js:15:17
     return this.element;
   }
 
-  setNext(next) {
-    this.next = next || null;
-  }
+  setNext(next) {}
 
   getNext() {
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] ConditionalExpression
src/models/LinkedListModels.js:16:17
   }
 
   setNext(next) {
-    this.next = next || null;
+    this.next = false;
   }
 
killedBy: Linked List Tests .push(element) insert node at end
statusReason: linkedList.getHead(...).getNext(...).getElement is not a function

[Killed] LogicalOperator
src/models/LinkedListModels.js:16:17
   }
 
   setNext(next) {
-    this.next = next || null;
+    this.next = next && null;
   }
 
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of null (reading 'getElement')

[Killed] BlockStatement
src/models/LinkedListModels.js:19:13
     this.next = next || null;
   }
 
-  getNext() {
-    return this.next;
-  }
+  getNext() {}
 
 };
killedBy: Linked List Tests .push(element) insert node at end
statusReason: Cannot read properties of undefined (reading 'getElement')

[Killed] BlockStatement
src/models/LinkedListModels.js:26:48
 };
 
 export class DoublyNode extends Node {
-    constructor(element, next=null, prev=null) {
-        super(element, next);
-        this.prev = prev;
-    }
+    constructor(element, next=null, prev=null) {}
     setElement(element) {
       this.element = element;
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/models/LinkedListModels.js:30:25
         super(element, next);
         this.prev = prev;
     }
-    setElement(element) {
-      this.element = element;
-    }
+    setElement(element) {}
   
     getElement() {
killedBy: Doubly Linked List Node Tests .setElement() set the value of node
statusReason: expected 4 to equal 8

[Killed] ConditionalExpression
src/models/LinkedListModels.js:39:19
     }
   
     setNext(next) {
-      this.next = next || null;
+      this.next = true;
     }
   
killedBy: Doubly Linked List Tests .push(element) insert node at end
statusReason: doublyLinkedList.getHead(...).getNext(...).getElement is not a function

[Killed] BlockStatement
src/models/LinkedListModels.js:45:19
     getNext() {
       return this.next;
     }
-    setPrev(prev) {
-      this.prev = prev || null;
-    }
+    setPrev(prev) {}
   
     getPrev() {
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '3' to equal '3,2,1'

[Killed] ConditionalExpression
src/models/LinkedListModels.js:46:19
       return this.next;
     }
     setPrev(prev) {
-      this.prev = prev || null;
+      this.prev = true;
     }
   
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: previous.getElement is not a function

[Killed] ConditionalExpression
src/models/LinkedListModels.js:46:19
       return this.next;
     }
     setPrev(prev) {
-      this.prev = prev || null;
+      this.prev = false;
     }
   
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: previous.getElement is not a function

[Killed] BlockStatement
src/models/LinkedListModels.js:49:15
       this.prev = prev || null;
     }
   
-    getPrev() {
-      return this.prev;
-    }
+    getPrev() {}
 }
killedBy: Doubly Linked List Tests .inverseToString() get inverse string of elements if non-empty
statusReason: expected '3' to equal '3,2,1'
