[Killed] BlockStatement
src/models/TreeModels.js:2:22
 export class TreeNode {
-    constructor(key) {
-        this.key = key;
-        this.left = null;
-        this.right = null;
-    }
+    constructor(key) {}
     getKey(){
         return(this.key);
killedBy: BST Tests .insert(key) insert element
statusReason: expected undefined to equal 10

[Killed] BlockStatement
src/models/TreeModels.js:7:13
         this.left = null;
         this.right = null;
     }
-    getKey(){
-        return(this.key);
-    }
+    getKey(){}
     setKey(key){
         this.key = key;
killedBy: BST Tests .insert(key) insert element
statusReason: expected undefined to equal 10

[Killed] BlockStatement
src/models/TreeModels.js:10:16
     getKey(){
         return(this.key);
     }
-    setKey(key){
-        this.key = key;
-    }
+    setKey(key){}
     getRight(){
         return(this.right);
killedBy: BST Tests .remove(key) remove a node with two children
statusReason: expected [ 3, 5, 10, 15 ] to deeply equal [ 3, 7, 10, 15 ]

[Killed] BlockStatement
src/models/TreeModels.js:13:15
     setKey(key){
         this.key = key;
     }
-    getRight(){
-        return(this.right);
-    }
+    getRight(){}
     getLeft(){
         return(this.left);
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: Cannot read properties of undefined (reading 'getKey')

[Killed] BlockStatement
src/models/TreeModels.js:16:14
     getRight(){
         return(this.right);
     }
-    getLeft(){
-        return(this.left);
-    }
+    getLeft(){}
 
     setRight(right){
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: Cannot read properties of undefined (reading 'getKey')

[Killed] BlockStatement
src/models/TreeModels.js:20:20
         return(this.left);
     }
 
-    setRight(right){
-        this.right = right;
-    }
+    setRight(right){}
     setLeft(left){
         this.left = left;
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 3, 5, 10 ] to deeply equal [ 3, 5, 10, 15 ]

[Killed] BlockStatement
src/models/TreeModels.js:23:18
     setRight(right){
         this.right = right;
     }
-    setLeft(left){
-        this.left = left;
-    }
+    setLeft(left){}
 }
killedBy: BST Tests .inOrderTraverse(callback) insert elements and perform inorder traversal
statusReason: expected [ 10, 15 ] to deeply equal [ 3, 5, 10, 15 ]
