[Survived] ConditionalExpression
src/Data-Structures/DoublyLinkedList.js:30:17
         const node = new DoublyNode(element);
         let current = this.head;
         if (index === 0) {
-            if (this.head == null) { // NEW
+            if (true) { // NEW
                 this.head = node;
                 this.tail = node; // NEW
